[
  "5N Plus Inc. produces and sells engineered materials and specialty chemicals in Europe, Asia, the Americas, and internationally. It operates in two segments, Electronic Materials and Eco-Friendly Materials. The Electronic Materials segment manufactures and sells refined metals, compounds, and alloys, which are primarily used in a range of electronic applications covering various end-markets consisting of security, aerospace, sensing and imaging, renewable energy, and technical materials; and provides recycling services. Its products are associated with various metals, including cadmium, gallium, germanium, indium, and tellurium. The Eco-Friendly Materials segment principally manufactures and sells refined bismuth and bismuth chemicals, low melting-point and optical alloys, and refined selenium and selenium chemicals. Its products are used in the pharmaceutical, animal health, electronics, and industrial applications, as well as in the animal-feed industry. The company also offers semiconductor compounds and wafers; and fine metallic powders. 5N Plus Inc. is headquartered in Montreal, Canada.   5N Plus Inc. produces and sells engineered materials and specialty chemicals in Europe, Asia, the Americas, and internationally. It operates in two segments, Electronic Materials and Eco-Friendly Materials.",
  "5N Plus Inc. produces and sells engineered materials and specialty chemicals in Europe, Asia, the Americas, and internationally. It operates in two segments, Electronic Materials and Eco-Friendly Materials. The Electronic Materials segment manufactures and sells refined metals, compounds, and alloys, which are primarily used in a range of electronic applications covering various end-markets consisting of security, aerospace, sensing and imaging, renewable energy, and technical materials; and provides recycling services. Its products are associated with various metals, including cadmium, gallium, germanium, indium, and tellurium. The Eco-Friendly Materials segment principally manufactures and sells refined bismuth and bismuth chemicals, low melting-point and optical alloys, and refined selenium and selenium chemicals. Its products are used in the pharmaceutical, animal health, electronics, and industrial applications, as well as in the animal-feed industry. The company also offers semiconductor compounds and wafers; and fine metallic powders. 5N Plus Inc. is headquartered in Montreal, Canada.",
  "Adams Resources & Energy, Inc., through its subsidiaries, primarily engages in the marketing, transportation, and storage of crude oil in the United States. The company operates in two segments, Crude Oil Marketing, Transportation and Storage; and Tank Truck Transportation of Liquid Chemicals and Dry Bulk. The Crude Oil Marketing, Transportation and Storage segment purchases crude oil, and arranges sales and deliveries to refiners and other customers primarily onshore in Texas, Oklahoma, North Dakota, Michigan, and Louisiana. This segment owns and operates a fleet of 256 tractor-trailer rigs and maintains approximately 179 pipeline inventory locations or injection stations. The Tank Truck Transportation of Liquid Chemicals and Dry Bulk segment transports liquid chemicals and dry bulk on a for hire basis in the continental United States and into Canada and Mexico. It operates truck terminals in Houston, Corpus Christi, Nederland, and Freeport, Texas; Baton Rouge, St. Rose, and Boutte, Louisiana; Mobile, Alabama; and Charlotte, North Carolina. Adams Resources & Energy, Inc. was founded in 1947 and is headquartered in Houston, Texas.",
  "Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and services worldwide. The company produces atmospheric gases, including oxygen, nitrogen, argon, and rare gases; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, syngas, and specialty gases; and equipment for the production or processing of gases comprising air separation units and non-cryogenic generators for customers in various industries, including refining, chemical, gasification, metals, electronics, manufacturing, food and beverage, magnetic resonance imaging, energy production and refining, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. Air Products and Chemicals, Inc. was founded in 1940 and is headquartered in Allentown, Pennsylvania.",
  "Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. The company operates in three segments: Lithium, Bromine Specialties, and Catalysts. The Lithium segment offers lithium compounds, including lithium carbonate, lithium hydroxide, lithium chloride, and value-added lithium specialties, as well as reagents, such as butyllithium and lithium aluminum hydride for applications in lithium batteries for consumer electronics and electric vehicles, high performance greases, thermoplastic elastomers for car tires, rubber soles, plastic bottles, catalysts for chemical reactions, organic synthesis processes, life science, pharmaceutical, and other markets. It also offers cesium products for the chemical and pharmaceutical industries; zirconium, barium, and titanium products for various pyrotechnical applications; technical services, such as the handling and use of reactive lithium products; and recycling services for lithium-containing by-products. The Bromine Specialties segment offers bromine and bromine-based solutions for fire safety, chemical synthesis, mercury control, water purification, beef and poultry processing, and other industrial applications, as well as oil and gas well drilling, and completion fluids applications; and tertiary amines, biocides, disinfectants, and sanitizers. The Catalysts segment offers hydroprocessing catalysts together with isomerization and akylation catalysts; fluidized catalytic cracking catalysts and additives; and performance catalyst solutions comprising organometallics and curatives. The company serves energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, crop protection, and custom chemistry services markets. Albemarle Corporation was founded in 1994 and is headquartered in Charlotte, North Carolina.",
  "Berry Global Group, Inc. manufactures and supplies non-woven, flexible, and rigid products. Its Consumer Packaging International segment offers narrow neck blow molded and injection-stretch molded packaging solutions; injection molded and thermoformed pails, jars, and tubs; closures, dispensing systems, and applicators; inhalers and dose counters; polythene films; and molds and molded components, as well as recycles rigid and flexible end of life materials from industrial and consumer sources. Its Consumer Packaging North America segment provides containers for branded and private label customers; lightweight polypropylene cups and lids for hot and cold beverages; child-resistant, continuous-thread, and tamper closures, as well as aerosol overcaps; bottles and prescription vials; and extruded and laminate tubes. Its Engineered Materials segment offers engineered materials, including stretch and shrink films, and converter films; trash-can liners and food bags; cloth and foil, splicing and laminating, flame-retardant, flashing and seaming tapes, double-faced cloth, masking, mounting, OEM, and medical and specialty tapes; and food and consumer films, retail bags, and polyvinyl chloride films, and agriculture films. Its Health, Hygiene & Specialties segment provides medical garment materials, surgical drapes, household cleaning wipes, and face masks for infection prevention; components for baby diapers, adult incontinence, and other absorbent hygiene products, elastic films and laminates, and substrates for dryer sheets; and products and components of products for geosynthetics and filtration products. The company serves consumer and industrial end markets in North America, South America, Europe, the Middle East, India, Africa, and the Asia Pacific. The company was formerly known as Berry Plastics Group, Inc. and changed its name to Berry Global Group, Inc. in April 2017. Berry Global Group, Inc. was founded in 1967 and is headquartered in Evansville, Indiana.   Berry Global Group, Inc. manufactures and supplies non-woven, flexible, and rigid products.",
  "Berry Global Group, Inc. manufactures and supplies non-woven, flexible, and rigid products. Its Consumer Packaging International segment offers narrow neck blow molded and injection-stretch molded packaging solutions; injection molded and thermoformed pails, jars, and tubs; closures, dispensing systems, and applicators; inhalers and dose counters; polythene films; and molds and molded components, as well as recycles rigid and flexible end of life materials from industrial and consumer sources. Its Consumer Packaging North America segment provides containers for branded and private label customers; lightweight polypropylene cups and lids for hot and cold beverages; child-resistant, continuous-thread, and tamper closures, as well as aerosol overcaps; bottles and prescription vials; and extruded and laminate tubes. Its Engineered Materials segment offers engineered materials, including stretch and shrink films, and converter films; trash-can liners and food bags; cloth and foil, splicing and laminating, flame-retardant, flashing and seaming tapes, double-faced cloth, masking, mounting, OEM, and medical and specialty tapes; and food and consumer films, retail bags, and polyvinyl chloride films, and agriculture films. Its Health, Hygiene & Specialties segment provides medical garment materials, surgical drapes, household cleaning wipes, and face masks for infection prevention; components for baby diapers, adult incontinence, and other absorbent hygiene products, elastic films and laminates, and substrates for dryer sheets; and products and components of products for geosynthetics and filtration products. The company serves consumer and industrial end markets in North America, South America, Europe, the Middle East, India, Africa, and the Asia Pacific. The company was formerly known as Berry Plastics Group, Inc. and changed its name to Berry Global Group, Inc. in April 2017. Berry Global Group, Inc. was founded in 1967 and is headquartered in Evansville, Indiana.",
  "Blueknight Energy Partners, L.P. provides integrated terminalling, gathering, and transportation services for companies engaged in the production, distribution, and marketing of liquid asphalt and crude oil products in the United States. The company operates through four segments: Asphalt Terminalling Services, Crude Oil Terminalling Services, Crude Oil Pipeline Services, and Crude Oil Trucking Services. The company's Asphalt Terminalling Services segment offers asphalt terminalling services, including storage, blending, processing, and throughput services for liquid asphalt product and residual fuel oil. As of March 23, 2020, this segment had 53 terminals located in 26 states. Its Crude Oil Terminalling Services segment provides terminalling services, including storage, blending, processing, and throughput services for crude oil. This segment owns and operates 34 crude oil storage tanks with approximately 6.6 million barrels of storage capacity. The company's Crude Oil Pipeline Services segment owns and operates crude oil transportation system with a combined length of approximately 611 miles; and purchases crude oil from production leases in Oklahoma and markets those barrels at the Cushing Interchange. Its Crude Oil Trucking Services segment owns and leases tanker trucks for gathering crude oil for its customers at remote wellhead locations. This segment owns or leases approximately 63 tanker trucks. Blueknight Energy Partners G.P., L.L.C. operates as a general partner of the company. The company was formerly known as SemGroup Energy Partners, L.P. and changed its name to Blueknight Energy Partners, L.P. in December 2009. Blueknight Energy Partners, L.P. was founded in 2007 and is headquartered in Tulsa, Oklahoma.   Blueknight Energy Partners, L.P. provides integrated terminalling, gathering, and transportation services for companies engaged in the production, distribution, and marketing of liquid asphalt and crude oil products in the United States.",
  "Blueknight Energy Partners, L.P. provides integrated terminalling, gathering, and transportation services for companies engaged in the production, distribution, and marketing of liquid asphalt and crude oil products in the United States. The company operates through four segments: Asphalt Terminalling Services, Crude Oil Terminalling Services, Crude Oil Pipeline Services, and Crude Oil Trucking Services. The company's Asphalt Terminalling Services segment offers asphalt terminalling services, including storage, blending, processing, and throughput services for liquid asphalt product and residual fuel oil. As of March 23, 2020, this segment had 53 terminals located in 26 states. Its Crude Oil Terminalling Services segment provides terminalling services, including storage, blending, processing, and throughput services for crude oil. This segment owns and operates 34 crude oil storage tanks with approximately 6.6 million barrels of storage capacity. The company's Crude Oil Pipeline Services segment owns and operates crude oil transportation system with a combined length of approximately 611 miles; and purchases crude oil from production leases in Oklahoma and markets those barrels at the Cushing Interchange. Its Crude Oil Trucking Services segment owns and leases tanker trucks for gathering crude oil for its customers at remote wellhead locations. This segment owns or leases approximately 63 tanker trucks. Blueknight Energy Partners G.P., L.L.C. operates as a general partner of the company. The company was formerly known as SemGroup Energy Partners, L.P. and changed its name to Blueknight Energy Partners, L.P. in December 2009. Blueknight Energy Partners, L.P. was founded in 2007 and is headquartered in Tulsa, Oklahoma.",
  "Bri-Chem Corp. engages in the wholesale supply of drilling fluids and chemicals to the oil and gas industry in North America. It operates through five segments: Fluids Distribution Canada, Fluids Distribution USA, Fluids Blending & Packaging Canada, Fluids Blending & Packaging USA, and Other. The company supplies, blends, and packages drilling fluid products in various weights and clays, lost circulation materials, chemicals, and oil mud products. It also offers completion, cementing, acidizing, stimulation, and production chemicals; and sells calcium nitrate, silica fume, hydrated lime, potash, sodium carbonate, surfactants, and soda ash. In addition, the company provides testing of drilling fluids for customers for various analyses, including viscosity, fluid loss, lubricity, and others. Further, it provides various services to the oil and gas, industrial, agriculture, construction, and resource industries; and blends cementing additives, as well as holds truck and trailers. The company was founded in 1985 and is headquartered in Edmonton, Canada.   Bri-Chem Corp. engages in the wholesale supply of drilling fluids and chemicals to the oil and gas industry in North America. It operates through five segments: Fluids Distribution Canada, Fluids Distribution USA, Fluids Blending & Packaging Canada, Fluids  Blending & Packaging USA, and Other.",
  "Bri-Chem Corp. engages in the wholesale supply of drilling fluids and chemicals to the oil and gas industry in North America. It operates through five segments: Fluids Distribution Canada, Fluids Distribution USA, Fluids Blending & Packaging Canada, Fluids Blending & Packaging USA, and Other. The company supplies, blends, and packages drilling fluid products in various weights and clays, lost circulation materials, chemicals, and oil mud products. It also offers completion, cementing, acidizing, stimulation, and production chemicals; and sells calcium nitrate, silica fume, hydrated lime, potash, sodium carbonate, surfactants, and soda ash. In addition, the company provides testing of drilling fluids for customers for various analyses, including viscosity, fluid loss, lubricity, and others. Further, it provides various services to the oil and gas, industrial, agriculture, construction, and resource industries; and blends cementing additives, as well as holds truck and trailers. The company was founded in 1985 and is headquartered in Edmonton, Canada.",
  "Cabot Corporation operates as a specialty chemicals and performance materials company. The company offers rubber grade carbon blacks used in tires as a rubber reinforcing agent and performance additive, as well as in industrial products, such as hoses, belts, extruded profiles, and molded goods; and compounds of carbon black and rubber. It also provides specialty grades of carbon black used in inks, coatings, plastics, adhesives, toners, batteries, and displays applications; masterbatch and conductive compound products for use in automotive, industrial, packaging, infrastructure, agriculture, consumer products, and electronics industries; inkjet colorants used in the inkjet printing applications; fumed silica used in adhesives, sealants, cosmetics, batteries, inks, toners, silicone elastomers, coatings, polishing slurries, and pharmaceuticals; fumed alumina used in various products, including inkjet media, lighting, coatings, cosmetics, and polishing slurries; and aerogel, a hydrophobic, silica-based particle for use in various thermal insulation and specialty chemical applications. In addition, the company offers activated carbon products used for the purification of water, air, food and beverages, pharmaceuticals, and other liquids and gases; and activated carbon solutions for activated carbon injection in coal-fired utilities, mobile water filter units, and carbon reactivation services. Cabot Corporation sells its products primarily through distributors and sales representatives in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Cabot Corporation was founded in 1882 and is headquartered in Boston, Massachusetts.",
  "Cabot Microelectronics Corporation, together with its subsidiaries, provides consumable materials to semiconductor manufacturers, and pipeline and adjacent industry customers worldwide. The Electronic Materials segment provides CMP slurries, which are liquid solutions composed of high-purity deionized water, proprietary chemical additives, and engineered abrasives that chemically and mechanically interact with the surface material of the IC device at an atomic level; and CMP pads that are engineered polymeric materials designed to distribute and transport the slurry to the surface of the wafer and distribute it evenly across the wafer. The company's CMP slurries are used for polishing various materials that conduct electrical signals, including tungsten, copper, tantalum, and aluminum; and various materials that are used in the production of rigid disks and magnetic heads for hard disk drives, as well as used in the dielectric insulating materials that separate conductive layers within logic and memory IC devices. This segment also designs and produces precision polishing and metrology systems to attain near-perfect shape and surface finish on various optical components, such as mirrors, lenses, and prisms. In addition, this segment offers sulfuric, phosphoric, nitric, and hydrofluoric acids, as well as ammonium hydroxide, hydrogen peroxide, isopropyl alcohol, other specialty organic solvents, and various blends of chemicals. The Performance Materials segment provides polymer-based drag-reducing agents for light, medium, and heavy crude oil transmission; wood treatment products, such as solid blocks and concentrated solutions; and precision polishing and metrology systems for advanced optics applications. This segment also provides MR polishing fluids, consumables, and spare and replacement parts, as well as optical polishing services and other customer support services. Cabot Microelectronics Corporation was founded in 1999 and is headquartered in Aurora, Illinois.   Cabot Microelectronics Corporation, together with its subsidiaries, provides consumable materials to semiconductor manufacturers, and pipeline and adjacent industry customers worldwide.",
  "Cabot Microelectronics Corporation, together with its subsidiaries, provides consumable materials to semiconductor manufacturers, and pipeline and adjacent industry customers worldwide. The Electronic Materials segment provides CMP slurries, which are liquid solutions composed of high-purity deionized water, proprietary chemical additives, and engineered abrasives that chemically and mechanically interact with the surface material of the IC device at an atomic level; and CMP pads that are engineered polymeric materials designed to distribute and transport the slurry to the surface of the wafer and distribute it evenly across the wafer. The company's CMP slurries are used for polishing various materials that conduct electrical signals, including tungsten, copper, tantalum, and aluminum; and various materials that are used in the production of rigid disks and magnetic heads for hard disk drives, as well as used in the dielectric insulating materials that separate conductive layers within logic and memory IC devices. This segment also designs and produces precision polishing and metrology systems to attain near-perfect shape and surface finish on various optical components, such as mirrors, lenses, and prisms. In addition, this segment offers sulfuric, phosphoric, nitric, and hydrofluoric acids, as well as ammonium hydroxide, hydrogen peroxide, isopropyl alcohol, other specialty organic solvents, and various blends of chemicals. The Performance Materials segment provides polymer-based drag-reducing agents for light, medium, and heavy crude oil transmission; wood treatment products, such as solid blocks and concentrated solutions; and precision polishing and metrology systems for advanced optics applications. This segment also provides MR polishing fluids, consumables, and spare and replacement parts, as well as optical polishing services and other customer support services. Cabot Microelectronics Corporation was founded in 1999 and is headquartered in Aurora, Illinois.",
  "Calumet Specialty Products Partners, L.P. produces and sells specialty hydrocarbon products in North America and internationally. Its Specialty Products segment offers various lubricating oils, white mineral oils, solvents, petrolatums, waxes, synthetic lubricants, and other products, which are used primarily as raw material components for basic industrial, consumer, and automotive goods. The company's Fuel Products segment provides fuel and fuel-related products, including gasoline, diesel, jet fuel, asphalt, and heavy fuel oils, as well as resells purchased crude oil to third party customers. Calumet GP, LLC serves as the general partner for Calumet Specialty Products Partners, L.P. The company was founded in 1916 and is headquartered in Indianapolis, Indiana.   Calumet Specialty Products Partners, L.P. produces and sells specialty hydrocarbon products in North America and internationally.",
  "Calumet Specialty Products Partners, L.P. produces and sells specialty hydrocarbon products in North America and internationally. Its Specialty Products segment offers various lubricating oils, white mineral oils, solvents, petrolatums, waxes, synthetic lubricants, and other products, which are used primarily as raw material components for basic industrial, consumer, and automotive goods. The company's Fuel Products segment provides fuel and fuel-related products, including gasoline, diesel, jet fuel, asphalt, and heavy fuel oils, as well as resells purchased crude oil to third party customers. Calumet GP, LLC serves as the general partner for Calumet Specialty Products Partners, L.P. The company was founded in 1916 and is headquartered in Indianapolis, Indiana.",
  "Cardinal Ethanol, LLC produces and sells fuel-grade ethanol, distillers grains, corn oil, and carbon dioxide in the continental United States. The company's ethanol is used as an octane enhancer in fuels; an oxygenated fuel additive for reducing ozone and carbon monoxide emissions; and a non-petroleum-based gasoline substitute. It also offers distillers grains, which are used as animal feed supplement for dairy, beef, poultry, and swine industries; corn oil that is used as a feed ingredient, feedstock to produce biodiesel, and for other industrial uses; and carbon dioxide gas. The company sells its products directly, as well as through third party brokers. The company was formerly known as Indiana Ethanol, LLC and changed its name to Cardinal Ethanol, LLC in September 2005. Cardinal Ethanol, LLC was founded in 2005 and is based in Union City, Indiana.   Cardinal Ethanol, LLC produces and sells fuel-grade ethanol, distillers grains, corn oil, and carbon dioxide in the continental United States.",
  "Cardinal Ethanol, LLC produces and sells fuel-grade ethanol, distillers grains, corn oil, and carbon dioxide in the continental United States. The company's ethanol is used as an octane enhancer in fuels; an oxygenated fuel additive for reducing ozone and carbon monoxide emissions; and a non-petroleum-based gasoline substitute. It also offers distillers grains, which are used as animal feed supplement for dairy, beef, poultry, and swine industries; corn oil that is used as a feed ingredient, feedstock to produce biodiesel, and for other industrial uses; and carbon dioxide gas. The company sells its products directly, as well as through third party brokers. The company was formerly known as Indiana Ethanol, LLC and changed its name to Cardinal Ethanol, LLC in September 2005. Cardinal Ethanol, LLC was founded in 2005 and is based in Union City, Indiana.",
  "Carlisle Companies Incorporated operates as a diversified manufacturer of engineered products in the United States, Europe, Asia, Canada, Mexico, the Middle East, Africa, and internationally. The company's Carlisle Construction Materials segment offers thermoplastic polyolefin, ethylene propylene diene monomer rubber, and polyvinyl chloride roofing membranes that are used on non-residential low-sloped roofs; roofing accessories, such as flashings, fasteners, sealing tapes, coatings, and waterproofing products; rigid foam insulation panels for roofing applications; specialty polyurethane products; vapor and air barriers, HVAC duct sealants, and hardware; and block molded polystyrene. Its Carlisle Interconnect Technologies segment engineers, manufactures, and sells wires, cables, connectors, contacts and cable assemblies, and satellite communication equipment to transfer power and data for the aerospace, medical, defense electronics, test and measurement equipment, and other industrial markets; and thermoforming, medical device contract manufacturing, precision machining and metals, and medical injection molding to medical device markets. The company's Carlisle Fluid Technologies segment offers liquid and powder finishing equipment and system components in the automotive, automotive refinishing, aerospace, agriculture, construction, marine, and rail industries. Its Carlisle Brake & Friction segment provides braking products and systems, and clutch transmission friction products for off-highway, on-highway, aircraft, and other industrial applications; and motorsport braking products. The company sells its product under the Binks, DeVilbiss, Ransburg, BGK, MS Powder, Hawk, Wellman, and Velvetouch brand names. It also distributes architectural metal roof panels, steel and aluminum flat sheets and coils, wall panels, perimeter roof edge systems, and related accessories. Carlisle Companies Incorporated was founded in 1917 and is headquartered in Scottsdale, Arizona.",
  "Celanese Corporation, a technology and specialty materials company, manufactures and sells high performance engineered polymers in the United States and internationally. The company operates through Engineered Materials, Acetate Tow, and Acetyl Chain segments. The Engineered Materials segment develops, produces, and supplies specialty polymers for automotive and medical applications, as well as for use in industrial products and consumer electronics. It also offers acesulfame potassium, a sweetener for use in various beverages, confections, and dairy products; and food protection ingredients, such as potassium sorbate and sorbic acid for use in foods, beverages, and personal care products. The Acetate Tow segment provides acetate tows and flakes for use in filter products applications. The Acetyl Chain segment produces and supplies acetyl products, including acetic acid, vinyl acetate monomers, acetic anhydride, and acetate esters that are used as starting materials for colorants, paints, adhesives, coatings, and pharmaceuticals; and organic solvents and intermediates for pharmaceutical, agricultural, and chemical products. It also offers vinyl acetate-based emulsions for use in paints and coatings, adhesives, construction, glass fiber, textiles, and paper applications; and ethylene vinyl acetate resins and compounds, as well as low-density polyethylene for use in flexible packaging films, lamination film products, hot melt adhesives, automotive parts, and carpeting applications. Celanese Corporation was founded in 1918 and is headquartered in Irving, Texas.   Celanese Corporation, a technology and specialty materials company, manufactures and sells high performance engineered polymers in the United States and internationally. The company operates through Engineered Materials, Acetate Tow, and Acetyl Chain segme nts.",
  "Celanese Corporation, a technology and specialty materials company, manufactures and sells high performance engineered polymers in the United States and internationally. The company operates through Engineered Materials, Acetate Tow, and Acetyl Chain segments. The Engineered Materials segment develops, produces, and supplies specialty polymers for automotive and medical applications, as well as for use in industrial products and consumer electronics. It also offers acesulfame potassium, a sweetener for use in various beverages, confections, and dairy products; and food protection ingredients, such as potassium sorbate and sorbic acid for use in foods, beverages, and personal care products. The Acetate Tow segment provides acetate tows and flakes for use in filter products applications. The Acetyl Chain segment produces and supplies acetyl products, including acetic acid, vinyl acetate monomers, acetic anhydride, and acetate esters that are used as starting materials for colorants, paints, adhesives, coatings, and pharmaceuticals; and organic solvents and intermediates for pharmaceutical, agricultural, and chemical products. It also offers vinyl acetate-based emulsions for use in paints and coatings, adhesives, construction, glass fiber, textiles, and paper applications; and ethylene vinyl acetate resins and compounds, as well as low-density polyethylene for use in flexible packaging films, lamination film products, hot melt adhesives, automotive parts, and carpeting applications. Celanese Corporation was founded in 1918 and is headquartered in Irving, Texas.",
  "Cenovus Energy Inc., together with its subsidiaries, develops, produces, and markets crude oil, natural gas liquids, and natural gas in Canada and the United States. The company operates through Oil Sands, Deep Basin, and Refining and Marketing segments. The Oil Sands segment develops and produces bitumen in northeast Alberta. Its bitumen assets include Foster Creek, Christina Lake, and Narrows Lake, as well as other projects in the early stages of development. The Deep Basin segment holds assets primarily located in Elmworth-Wapiti, Kaybob-Edson, and Clearwater operating areas of British Columbia and Alberta, as well as various interests in natural gas processing facilities. The Refining and Marketing segment transports, sells, and refines crude oil into petroleum and chemical products. This segment owns a 50% ownership in Wood River and Borger refineries located in the United States; and owns and operates a crude-by-rail terminal in Alberta. Cenovus Energy Inc. was founded in 2009 and is headquartered in Calgary, Canada.   Cenovus Energy Inc., together with its subsidiaries, develops, produces, and markets crude oil, natural gas liquids, and natural gas in Canada and the United States. The company operates through Oil Sands, Deep Basin, and Refining and Marketing segments.",
  "Cenovus Energy Inc., together with its subsidiaries, develops, produces, and markets crude oil, natural gas liquids, and natural gas in Canada and the United States. The company operates through Oil Sands, Deep Basin, and Refining and Marketing segments. The Oil Sands segment develops and produces bitumen in northeast Alberta. Its bitumen assets include Foster Creek, Christina Lake, and Narrows Lake, as well as other projects in the early stages of development. The Deep Basin segment holds assets primarily located in Elmworth-Wapiti, Kaybob-Edson, and Clearwater operating areas of British Columbia and Alberta, as well as various interests in natural gas processing facilities. The Refining and Marketing segment transports, sells, and refines crude oil into petroleum and chemical products. This segment owns a 50% ownership in Wood River and Borger refineries located in the United States; and owns and operates a crude-by-rail terminal in Alberta. Cenovus Energy Inc. was founded in 2009 and is headquartered in Calgary, Canada.",
  "Chase Corporation, a specialty chemicals company, manufactures and sells protective materials for various applications worldwide. It operates through three segments: Adhesives, Sealants and Additives; Industrial Tapes; and Corrosion Protection and Waterproofing. The Adhesives, Sealants and Additives segment offers protective conformal and moisture protective electronic coatings; advanced adhesives, sealants, and coatings; polymeric microspheres; polyurethane dispersions; and superabsorbent polymers. The Industrial Tapes segment provides specialty tapes and related products; insulating and conducting materials; laminated durable papers; water-blocking compounds; laminated film foils and cover tapes; and pulling and detection tapes. The Corrosion Protection and Waterproofing segment offers protective pipe-coating tapes and other protectants; polymer additives; waterproofing membranes; waterproofing sealants, expansion joints, and accessories; technological products, and tapes and membranes; specialized high-performance coating and lining systems; waterproofing and corrosion protection systems; and bitumen pipeline protection tapes and products. The company sells its products through its salespeople, as well as manufacturers' representatives and distributors. Chase Corporation was founded in 1946 and is headquartered in Westwood, Massachusetts.",
  "The Chemours Company provides performance chemicals in North America, the Asia Pacific, Europe, the Middle East, Africa, and Latin America. It operates through three segments: Fluoroproducts, Chemical Solutions, and Titanium Technologies. The Fluoroproducts segment offers fluorochemicals, including refrigerants, foam blowing agents, and propellants under the Freon and Opteon brand names; fluoropolymers, such as industrial resins, specialty products, and coatings under the Teflon, Viton, Krytox, and Nafion brands; and fluoroelastomer products under the Viton brand name for electronics, communications, automotive, wire and cable, energy, oil and gas, aerospace, and other applications. The Chemical Solutions segment provides industrial and specialty chemicals for gold production, consumer, plastics and coatings, refrigeration and air conditioning, general industrial, electronics, mining, and oil refining industries. The Titanium Technologies segment manufactures and sells titanium dioxide pigments under the Ti-Pure and BaiMax brands for applications in architectural and industrial coatings, flexible and rigid plastic packaging, polyvinylchloride, laminate papers, and coated papers and paperboards used for packaging. It sell its products through direct channels, as well as through a network of resellers and distributors. The Chemours Company was founded in 2014 and is headquartered in Wilmington, Delaware.",
  "Chemtrade Logistics Income Fund provides industrial chemicals and services in Canada, the United States, and South America. It operates through Sulphur Products and Performance chemicals (SPPC), Water Solutions and Specialty Chemicals (WSSC), and Electrochemicals (EC) segments. The SPPC segment removes and/or produces merchant, regenerated, and ultra-pure sulphuric acid, sodium hydrosulphite, elemental sulphur, liquid sulphur dioxide, hydrogen sulphide, sodium bisulphite, and sulphides. This segment also offers industrial services, such as processing by-products and waste streams. Its WSSC segment manufactures and markets various inorganic coagulants used in water treatment, including aluminum sulphate, aluminum chlorohydrate, polyaluminum chloride, and ferric sulphate; and a range of specialty chemicals, such as sodium nitrite, potassium chloride, phosphorus pentasulphide, and vaccine adjuvants. The EC segment manufactures and markets sodium chlorate and chlor-alkali products, including caustic soda, chlorine, and hydrochloric acid for the pulp and paper, oil and gas, and water treatment industries. Chemtrade Logistics Income Fund was founded in 2001 and is headquartered in Toronto, Canada.   Chemtrade Logistics Income Fund provides industrial chemicals and services in Canada, the United States, and South America. It operates through Sulphur Products and Performance chemicals (SPPC), Water Solutions and Specialty Chemicals (WSSC), and Electroch emicals (EC) segments.",
  "Chemtrade Logistics Income Fund provides industrial chemicals and services in Canada, the United States, and South America. It operates through Sulphur Products and Performance chemicals (SPPC), Water Solutions and Specialty Chemicals (WSSC), and Electrochemicals (EC) segments. The SPPC segment removes and/or produces merchant, regenerated, and ultra-pure sulphuric acid, sodium hydrosulphite, elemental sulphur, liquid sulphur dioxide, hydrogen sulphide, sodium bisulphite, and sulphides. This segment also offers industrial services, such as processing by-products and waste streams. Its WSSC segment manufactures and markets various inorganic coagulants used in water treatment, including aluminum sulphate, aluminum chlorohydrate, polyaluminum chloride, and ferric sulphate; and a range of specialty chemicals, such as sodium nitrite, potassium chloride, phosphorus pentasulphide, and vaccine adjuvants. The EC segment manufactures and markets sodium chlorate and chlor-alkali products, including caustic soda, chlorine, and hydrochloric acid for the pulp and paper, oil and gas, and water treatment industries. Chemtrade Logistics Income Fund was founded in 2001 and is headquartered in Toronto, Canada.",
  "Cheniere Energy Partners, L.P., through its subsidiaries, owns and operates regasification facilities at the Sabine Pass liquefied natural gas (LNG) terminal located in Cameron Parish, Louisiana on the Sabine-Neches Waterway. The company's regasification facilities include infrastructure of five LNG storage tanks with capacity of approximately 17 billion cubic feet equivalent; two marine berths that accommodate vessels of up to 266,000 cubic meters; and vaporizers with regasification capacity of approximately 4.0 billion cubic feet per day. It also owns the Creole Trail Pipeline, a 94-mile pipeline interconnecting the Sabine Pass LNG terminal with various interstate pipelines. Cheniere Energy Partners GP, LLC serves as the general partner of the company. Cheniere Energy Partners, L.P. was founded in 2003 and is headquartered in Houston, Texas.   Cheniere Energy Partners, L.P., through its subsidiaries, owns and operates regasification facilities at the Sabine Pass liquefied natural gas (LNG) terminal located in Cameron Parish, Louisiana on the Sabine-Neches Waterway.",
  "Cheniere Energy Partners, L.P., through its subsidiaries, owns and operates regasification facilities at the Sabine Pass liquefied natural gas (LNG) terminal located in Cameron Parish, Louisiana on the Sabine-Neches Waterway. The company's regasification facilities include infrastructure of five LNG storage tanks with capacity of approximately 17 billion cubic feet equivalent; two marine berths that accommodate vessels of up to 266,000 cubic meters; and vaporizers with regasification capacity of approximately 4.0 billion cubic feet per day. It also owns the Creole Trail Pipeline, a 94-mile pipeline interconnecting the Sabine Pass LNG terminal with various interstate pipelines. Cheniere Energy Partners GP, LLC serves as the general partner of the company. Cheniere Energy Partners, L.P. was founded in 2003 and is headquartered in Houston, Texas.",
  "Chevron Corporation, through its subsidiaries, engages in integrated energy, chemicals, and petroleum operations worldwide. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, and production of crude oil and natural gas; processing, liquefaction, transportation, and regasification associated with liquefied natural gas; transportation of crude oil through pipelines; and transportation, storage, and marketing of natural gas, as well as operates a gas-to-liquids plant. The Downstream segment engages in refining crude oil into petroleum products; marketing crude oil and refined products; transporting crude oil and refined products through pipeline, marine vessel, motor equipment, and rail car; and manufacturing and marketing commodity petrochemicals, and fuel and lubricant additives, as well as plastics for industrial uses. Chevron Corporation is also involved in the cash management and debt financing activities; insurance operations; real estate activities; and technology businesses. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.",
  "CHS Inc., an integrated agricultural company, provides grains, foods, and energy resources to businesses and consumers in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Energy, Ag, and Nitrogen Production. It is involved in the operation of petroleum refineries and pipelines; supply, marketing, and distribution of refined fuels, including gasoline, diesel fuel, and other energy products; blending, sale, and distribution of lubricants; and the supply of propane and other natural gas liquids. The company also processes and sells crude oil into refined petroleum products under the Cenex brand name to member cooperatives and other independent retailers through a network of approximately 1,500 sites; and provides transportation services. In addition, it markets grains and oilseeds; and offers seeds, crop nutrients, crop protection products, animal feed, animal health products, refined and renewable fuels, and propane, as well as refined oils, meal, soy flour, and processed sunflower products. Further, the company produces and sells nitrogen-based products, including methanol, UAN and urea, and related products; and offers cooperative associations with various loans that meet commercial agriculture needs and loans to individual producers, as well as consulting and commodity risk management services. CHS Inc. is headquartered in Inver Grove Heights, Minnesota.   CHS Inc., an integrated agricultural company, provides grains, foods, and energy resources to businesses and consumers in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Ener gy, Ag, and Nitrogen Production.",
  "CHS Inc., an integrated agricultural company, provides grains, foods, and energy resources to businesses and consumers in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Energy, Ag, and Nitrogen Production. It is involved in the operation of petroleum refineries and pipelines; supply, marketing, and distribution of refined fuels, including gasoline, diesel fuel, and other energy products; blending, sale, and distribution of lubricants; and the supply of propane and other natural gas liquids. The company also processes and sells crude oil into refined petroleum products under the Cenex brand name to member cooperatives and other independent retailers through a network of approximately 1,500 sites; and provides transportation services. In addition, it markets grains and oilseeds; and offers seeds, crop nutrients, crop protection products, animal feed, animal health products, refined and renewable fuels, and propane, as well as refined oils, meal, soy flour, and processed sunflower products. Further, the company produces and sells nitrogen-based products, including methanol, UAN and urea, and related products; and offers cooperative associations with various loans that meet commercial agriculture needs and loans to individual producers, as well as consulting and commodity risk management services. CHS Inc. is headquartered in Inver Grove Heights, Minnesota.",
  "Copart, Inc. provides online auctions and vehicle remarketing services. It offers a range of services for processing and selling vehicles over the Internet through its Virtual Bidding Third Generation Internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, and fleet operators and dealers, as well as for individual owners. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, virtual insured exchange, transportation, vehicle inspection stations, on-demand reporting, title processing and procurement, loan payoff, flexible vehicle processing programs, buy it now, member network, sales process, and dealer services. Its services also comprise services to sell vehicles through CashForCars.com; and U-Pull-It service that allows buyer to remove valuable parts, and sell the remaining parts and car body. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the general public. As of May 18, 2020, it operated through approximately 200 locations in 11 countries. Copart, Inc. was founded in 1982 and is headquartered in Dallas, Texas.",
  "CrossAmerica Partners LP engages in the wholesale distribution of motor fuels, and ownership and leasing of real estate used in the retail distribution of motor fuels in the United States. The company operates in two segments, Wholesale and Retail. The Wholesale segment engages in the wholesale distribution of motor fuels to lessee dealers, independent dealers, commission agents, and company operated retail sites. The Retail segment is involved in the sale of convenience merchandise items; and retail sale of motor fuels at company operated retail sites and retail sites operated by commission agents. As of April 14, 2020, the company distributed fuel to approximately 1,700 locations; and owned or leased approximately 1,100 sites. CrossAmerica GP LLC operates as the general partner of the company. The company was formerly known as Lehigh Gas Partners LP and changed its name to CrossAmerica Partners LP in October 2014. CrossAmerica Partners LP was founded in 1992 and is based in Allentown, Pennsylvania.",
  "CSW Industrials, Inc. operates as a diversified industrial company in the United States and internationally. It operates through two segments, Industrial Products and Specialty Chemicals. The Industrial Products segment offers specialty mechanical products; fire and smoke protection products; architecturally-specified building products; and storage, filtration, and application equipment for use with its specialty chemicals and other products for general industrial applications. The Specialty Chemicals segment offers lubricants and greases, drilling compounds, anti-seize compounds, chemical formulations, degreasers and cleaners, penetrants, pipe thread sealants, fire stopping sealants and caulks, and adhesives/solvent cement. The company serves the heating, ventilation, and air conditioning; and plumbing, refrigeration, electrical, commercial construction, rail car and locomotive, drilling and boring, water well drilling, mining, steel, power generation, cement, aviation, oil and gas, and general industrial markets. It sells its products under the RectorSeal No. 5, Kopr Kote, KATS Coatings, Jet-Lube Extreme, Smoke Guard, Safe-T-Switch, Mighty Bracket, Balco, Whitmore, Air Sentry, Oil Safe, Deacon, AC Leak Freeze, and Greco brands. The company was incorporated in 2014 and is headquartered in Dallas, Texas.",
  "CVR Energy, Inc., through its subsidiaries, engages in petroleum refining and nitrogen fertilizer manufacturing activities in the United States. The company operates through two segments, Petroleum and Nitrogen Fertilizer. The Petroleum segment refines and markets gasoline, diesel fuel, and other refined products. It owns and operates a coking medium-sour crude oil refinery in southeast Kansas; and a crude oil refinery in Wynnewood, Oklahoma, as well as supporting logistics assets. This segment primarily serves retailers, railroads, farm co-operatives, and other refiners/marketers. The Nitrogen Fertilizer segment owns and operates a nitrogen fertilizer plant in North America that utilizes a pet coke gasification process to produce nitrogen fertilizer products; and a nitrogen fertilizer facility in East Dubuque, Illinois that produces nitrogen fertilizers in the form of ammonia and UAN. It primarily markets UAN products to agricultural customers; and ammonia products to agricultural and industrial customers. CVR Energy, Inc. was founded in 1906 and is based in Sugar Land, Texas.   CVR Energy, Inc., through its subsidiaries, engages in petroleum refining and nitrogen fertilizer manufacturing activities in the United States. The company operates through two segments, Petroleum and Nitrogen Fertilizer.",
  "CVR Energy, Inc., through its subsidiaries, engages in petroleum refining and nitrogen fertilizer manufacturing activities in the United States. The company operates through two segments, Petroleum and Nitrogen Fertilizer. The Petroleum segment refines and markets gasoline, diesel fuel, and other refined products. It owns and operates a coking medium-sour crude oil refinery in southeast Kansas; and a crude oil refinery in Wynnewood, Oklahoma, as well as supporting logistics assets. This segment primarily serves retailers, railroads, farm co-operatives, and other refiners/marketers. The Nitrogen Fertilizer segment owns and operates a nitrogen fertilizer plant in North America that utilizes a pet coke gasification process to produce nitrogen fertilizer products; and a nitrogen fertilizer facility in East Dubuque, Illinois that produces nitrogen fertilizers in the form of ammonia and UAN. It primarily markets UAN products to agricultural customers; and ammonia products to agricultural and industrial customers. CVR Energy, Inc. was founded in 1906 and is based in Sugar Land, Texas.",
  "Delek Logistics Partners, LP owns and operates logistics and marketing assets for crude oil, and intermediate and refined products in the United States. It operates in two segments, Pipelines and Transportation, and Wholesale Marketing and Terminalling. The Pipelines and Transportation segment includes pipelines, trucks, and ancillary assets that provide crude oil gathering, crude oil intermediate and finished products transportation, and storage services primarily in support of the Tyler, El Dorado, and Big Spring refineries, as well as offers crude oil and other products transportation services to third parties. This segment operates approximately 700 miles of crude oil gathering system. The Wholesale Marketing and Terminalling segment provides wholesale marketing, transporting, storage, and terminalling services related to refined products to independent third parties. Delek Logistics GP, LLC serves as the general partner of the company. Delek Logistics Partners, LP was founded in 2012 and is headquartered in Brentwood, Tennessee. Delek Logistics Partners, LP is a subsidiary of Delek US Holdings, Inc.",
  "Delek US Holdings, Inc. engages in the integrated downstream energy business in the United States. The company operates in three segments: Refining, Logistics, and Retail. The Refining segment processes crude oil and other purchased feedstock for the manufacture of various grades of gasoline, diesel fuel, aviation fuel, asphalt, and other petroleum-based products that are distributed through owned and third-party product terminals. This segment owns and operates four independent refineries located in Tyler, Texas; El Dorado, Arkansas; Big Spring, Texas; and Krotz Springs, Louisiana, as well as two biodiesel facilities in Crossett, Arkansas, and Cleburne, Texas. The Logistics segment gathers, transports, and stores crude oil, intermediate, and refined products; and markets, distributes, transports, and stores refined products for third parties. This segment owns or leases capacity on approximately 400 miles of crude oil transportation pipelines, approximately 450 miles of refined product pipelines, an approximately 700-mile crude oil gathering system, and associated crude oil storage tanks with an aggregate of approximately 9.9 million barrels of active shell capacity; and owns and operates ten light product distribution terminals, as well as markets light products using third-party terminals. The Retail segment owns and leases 252 convenience store sites located primarily in Texas and New Mexico. Its convenience stores offer various grades of gasoline and diesel under the DK or Alon brand name; and food products and service, tobacco products, non-alcoholic and alcoholic beverages, and general merchandise, as well as money orders. The company serves oil companies, independent refiners and marketers, jobbers, distributors, utility and transportation companies, the U.S. government, and independent retail fuel operators. Delek US Holdings, Inc. was founded in 2001 and is headquartered in Brentwood, Tennessee.   Delek US Holdings, Inc. engages in the integrated downstream energy business in the United States. The company operates in three segments: Refining, Logistics, and Retail.",
  "Delek US Holdings, Inc. engages in the integrated downstream energy business in the United States. The company operates in three segments: Refining, Logistics, and Retail. The Refining segment processes crude oil and other purchased feedstock for the manufacture of various grades of gasoline, diesel fuel, aviation fuel, asphalt, and other petroleum-based products that are distributed through owned and third-party product terminals. This segment owns and operates four independent refineries located in Tyler, Texas; El Dorado, Arkansas; Big Spring, Texas; and Krotz Springs, Louisiana, as well as two biodiesel facilities in Crossett, Arkansas, and Cleburne, Texas. The Logistics segment gathers, transports, and stores crude oil, intermediate, and refined products; and markets, distributes, transports, and stores refined products for third parties. This segment owns or leases capacity on approximately 400 miles of crude oil transportation pipelines, approximately 450 miles of refined product pipelines, an approximately 700-mile crude oil gathering system, and associated crude oil storage tanks with an aggregate of approximately 9.9 million barrels of active shell capacity; and owns and operates ten light product distribution terminals, as well as markets light products using third-party terminals. The Retail segment owns and leases 252 convenience store sites located primarily in Texas and New Mexico. Its convenience stores offer various grades of gasoline and diesel under the DK or Alon brand name; and food products and service, tobacco products, non-alcoholic and alcoholic beverages, and general merchandise, as well as money orders. The company serves oil companies, independent refiners and marketers, jobbers, distributors, utility and transportation companies, the U.S. government, and independent retail fuel operators. Delek US Holdings, Inc. was founded in 2001 and is headquartered in Brentwood, Tennessee.",
  "Duke Energy Ohio, Inc., a regulated public utility, transmits and distributes electricity in Ohio and Kentucky. It operates through two segments, Electric Utilities and Infrastructure, and Gas Utilities and Infrastructure. The company also generates and sells electricity using coal, nuclear fuel, hydroelectric, solar, and natural gas sources in Kentucky; and transports and sells natural gas in Ohio and Kentucky. It supplies electric services to approximately 870,000 residential, commercial, and industrial customers covering an area of approximately 3,000 square miles; and provides transmission and distribution services of natural gas to approximately 542,000 customers. The company was formerly known as Cincinnati Gas & Electric Company. The company was founded in 1837 and is based in Cincinnati, Ohio. Duke Energy Ohio, Inc. is a subsidiary of Duke Energy Corporation.",
  "DuPont de Nemours, Inc. provides technology-based materials, ingredients, and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. The company provide Electronics & Imaging segment supplies materials to manufacture photovoltaics and solar cells; materials and printing systems to the advanced printing industry; and materials and solutions for the fabrication of semiconductors and integrated circuits addressing front-end and back-end of the manufacturing process. This segment also provides permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless, and electrolytic metallization solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for liquid crystal displays, advanced-matrix organic light emitting diode, and quantum dot applications. It also provide Transportation & Advanced Polymers segment provides engineering resins, adhesives, lubricants, and parts to engineers and designers in the transportation, electronics, healthcare, industrial, and consumer end-markets. The company in Safety & Construction segment provides engineered products and integrated systems for construction, worker safety, energy, oil and gas, transportation, medical device, and water purification and separation industries. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. is based in Wilmington, Delaware.",
  "Element Solutions Inc produces and sells specialty chemical products the United States, China, and internationally. The company operates in two segments, Electronics and Industrial & Specialty. The Electronics segment researches, formulates, and delivers specialty chemicals and materials for various types of electronics hardware products. This segment offers electronic assembly materials; circuitry solutions comprising circuit board metallization products, circuit formation products, and electronic materials; and semiconductor solutions. This segment primarily serves mobile communications, computers, automobiles, and aerospace equipment industries. The Industrial & Specialty segment provides industrial solutions, which include chemical systems that protect and decorate metal and plastic surfaces; graphics solutions that comprise consumable chemicals that enable printing image transfer on flexible packaging materials; and energy solutions, which consist of chemistries used in water-based hydraulic control fluids for offshore deep-water drilling. This segment's products include electroless nickel products, plating products, pre-treatment and cleaning solutions, functional conversion coatings, hard-coated films, and water treatment products; solid sheet printing elements and liquid imaging products; and offshore fluids. This segment serves the aerospace, automotive, construction, consumer electronics, consumer packaged goods, and oil and gas production end markets. The company was formerly known as Platform Specialty Products Corporation and changed its name to Element Solutions Inc in January 2019. Element Solutions Inc was founded in 1922 and is based in Fort Lauderdale, Florida.   Element Solutions Inc produces and sells specialty chemical products the United States, China, and internationally. The company operates in two segments, Electronics and Industrial & Specialty.",
  "Element Solutions Inc produces and sells specialty chemical products the United States, China, and internationally. The company operates in two segments, Electronics and Industrial & Specialty. The Electronics segment researches, formulates, and delivers specialty chemicals and materials for various types of electronics hardware products. This segment offers electronic assembly materials; circuitry solutions comprising circuit board metallization products, circuit formation products, and electronic materials; and semiconductor solutions. This segment primarily serves mobile communications, computers, automobiles, and aerospace equipment industries. The Industrial & Specialty segment provides industrial solutions, which include chemical systems that protect and decorate metal and plastic surfaces; graphics solutions that comprise consumable chemicals that enable printing image transfer on flexible packaging materials; and energy solutions, which consist of chemistries used in water-based hydraulic control fluids for offshore deep-water drilling. This segment's products include electroless nickel products, plating products, pre-treatment and cleaning solutions, functional conversion coatings, hard-coated films, and water treatment products; solid sheet printing elements and liquid imaging products; and offshore fluids. This segment serves the aerospace, automotive, construction, consumer electronics, consumer packaged goods, and oil and gas production end markets. The company was formerly known as Platform Specialty Products Corporation and changed its name to Element Solutions Inc in January 2019. Element Solutions Inc was founded in 1922 and is based in Fort Lauderdale, Florida.",
  "Exxon Mobil Corporation explores for and produces crude oil and natural gas in the United States, Canada/other Americas, Europe, Africa, Asia, and Australia/Oceania. It operates through Upstream, Downstream, and Chemical segments. The company is also involved in the manufacture, trade, transport, and sale of crude oil, petroleum products, and other specialty products; and manufactures and markets petrochemicals, including olefins, polyolefins, aromatics, and various other petrochemicals. As of December 31, 2019, it had approximately 23,857 net operated wells with proved reserves of 22.4 billion oil-equivalent barrels. In addition, the company produces raw materials, such as polypropylene and isopropyl alcohol for medical masks, gowns, and hand sanitizer. The company was founded in 1870 and is based in Irving, Texas.",
  "Flexible Solutions International Inc., together with its subsidiaries, develops, manufactures, and markets specialty chemicals that slow the evaporation of water in Canada, the United States, and internationally. The company operates in two segments, Energy and Water Conservation Products, and Biodegradable Polymers. The company offers thermal polyaspartates (TPAs) for oilfields to reduce scale and corrosion in various water systems; and for the agricultural industry to reduce fertilizer crystallization before, during, and after application, as well as to prevent crystal formation between fertilizer and minerals present in the soil. It also provides TPAs for irrigation to prevent early plugging of drip irrigation ports, reduce maintenance costs, and lengthen the life of equipment; and TPAs as additives for household laundry detergents, consumer care products, and pesticides. In addition, the company offers nitrogen conservation products for agriculture that slow down nitrogen loss from fields. Further, it provides HEATSAVR, a chemical product for use in swimming pools and spas that forms a thin and transparent layer on the water's surface; and WATERSAVR to reduce water evaporation in reservoirs, potable water storage tanks, livestock watering ponds, aqueducts, canals, and irrigation ditches, as well as for lawn and turf care, and potted and bedding plants. The company is headquartered in Taber, Canada.   Flexible Solutions International Inc., together with its subsidiaries, develops, manufactures, and markets specialty chemicals that slow the evaporation of water in Canada, the United States, and internationally.",
  "Flexible Solutions International Inc., together with its subsidiaries, develops, manufactures, and markets specialty chemicals that slow the evaporation of water in Canada, the United States, and internationally. The company operates in two segments, Energy and Water Conservation Products, and Biodegradable Polymers. The company offers thermal polyaspartates (TPAs) for oilfields to reduce scale and corrosion in various water systems; and for the agricultural industry to reduce fertilizer crystallization before, during, and after application, as well as to prevent crystal formation between fertilizer and minerals present in the soil. It also provides TPAs for irrigation to prevent early plugging of drip irrigation ports, reduce maintenance costs, and lengthen the life of equipment; and TPAs as additives for household laundry detergents, consumer care products, and pesticides. In addition, the company offers nitrogen conservation products for agriculture that slow down nitrogen loss from fields. Further, it provides HEATSAVR, a chemical product for use in swimming pools and spas that forms a thin and transparent layer on the water's surface; and WATERSAVR to reduce water evaporation in reservoirs, potable water storage tanks, livestock watering ponds, aqueducts, canals, and irrigation ditches, as well as for lawn and turf care, and potted and bedding plants. The company is headquartered in Taber, Canada.",
  "H.B. Fuller Company, together with its subsidiaries, formulates, manufactures, and markets adhesives, sealants, coatings, polymers, tapes, encapsulants, additives, and other specialty chemical products worldwide. The company operates through five segments: Americas Adhesives, EIMEA, Asia Pacific, Construction Adhesives, and Engineering Adhesives. It produces and supplies industrial adhesives products for applications in various markets, including appliances, filters, and insulating glass; food and beverage containers, flexible packaging, consumer goods, package integrity and re-enforcement, and durable and non-durable goods; corrugation, folding carton, tape and label, paper converting, envelopes, books, multi-wall bags, sacks, and tissue and towel; nonwoven and hygiene, such as disposable diapers, feminine care, and medical garments; windows, doors, and wood flooring; and insulating glass and textile. The company also provides specialty adhesives, including thermoplastic, thermoset, reactive, water-based, and solvent-based products; and products used for tile setting, commercial roofing, heating, ventilation, and air conditioning and insulation applications, as well as caulks and sealants for the consumer market and professional trade. In addition, it produces and supplies high performance industrial adhesives to the transportation, electronics, medical, clean energy, aerospace and defense, appliance, and heavy machinery markets. The company sells its products directly through distributors and retailers. H.B. Fuller Company was founded in 1887 and is headquartered in Saint Paul, Minnesota.",
  "FutureFuel Corp., through its subsidiary, FutureFuel Chemical Company, manufactures and sells diversified chemical, bio-based fuel, and bio-based specialty chemical products in the United States and internationally. The company operates through two segments, Chemicals and Biofuels. The Chemicals segment provides various custom chemicals that are used in the agricultural chemical, coatings, chemical intermediates, industrial and consumer cleaning, oil and gas, and specialty polymers industries; and performance chemicals, such as polymer modifiers, glycerin products, and various specialty chemicals and solvents. The Biofuels segment is involved in the production and sale of biodiesel and petrodiesel blends; and the buying, sale, and shipping of refined petroleum products on common carrier pipelines. This segment markets its biodiesel products directly to customers through trucks, rail, and barges. The company is headquartered in Saint Louis, Missouri.   FutureFuel Corp., through its subsidiary, FutureFuel Chemical Company, manufactures and sells diversified chemical, bio-based fuel, and bio-based specialty chemical products in the United States and internationally. The company operates through two segment s, Chemicals and Biofuels.",
  "FutureFuel Corp., through its subsidiary, FutureFuel Chemical Company, manufactures and sells diversified chemical, bio-based fuel, and bio-based specialty chemical products in the United States and internationally. The company operates through two segments, Chemicals and Biofuels. The Chemicals segment provides various custom chemicals that are used in the agricultural chemical, coatings, chemical intermediates, industrial and consumer cleaning, oil and gas, and specialty polymers industries; and performance chemicals, such as polymer modifiers, glycerin products, and various specialty chemicals and solvents. The Biofuels segment is involved in the production and sale of biodiesel and petrodiesel blends; and the buying, sale, and shipping of refined petroleum products on common carrier pipelines. This segment markets its biodiesel products directly to customers through trucks, rail, and barges. The company is headquartered in Saint Louis, Missouri.",
  "GCP Applied Technologies Inc. produces and sells specialty construction chemicals and specialty building materials worldwide. Its Specialty Construction Chemicals segment offers concrete admixtures under the CONCERA, CLARENA, ADVA, STRUX, MIRA, TYTRO, POLARSET, ECLIPSE, DARACEM, DARASET, DCI, RECOVER, WRDA, and ZYLA brands; admixtures for decorative concrete under the PIERI brand; concrete production management and engineered systems under the VERIFI and DUCTILCRETE brands; and cement additives under the OPTEVA HE, TAVERO VM, CBA, SYNCHRO, HEA2, TDA, and ESE brands. The company's Specialty Building Materials segment provides building envelope products to protect structures from water, and manages air and vapor transmission through building walls under the BITUTHENE, PREPRUFE, ADPRUFE, HYDRODUCT, ADCOR, SILCOR, PERM-A-BARRIER, ELIMINATOR, and INTEGRITANK brands; and residential building products comprising specialty roofing membranes and flexible flashings under the ICE & WATER SHIELD, TRI-FLEX, and VYCOR brands. This segment also offers fire protection products under the MONOKOTE brand; chemical grouts for repair and remediation in waterproofing and soil stabilization applications under the DE NEEF, HYDRO ACTIVE, SWELLSEAL, and DE NEEF PURe brands; cementitious grouts and mortars for under filling and gap filling purposes under the BETEC brand; and specialty flooring products, such as flooring moisture barriers and installation products under the KOVARA and ORCON brands. The company was incorporated in 2015 and is headquartered in Cambridge, Massachusetts.",
  "Genesis Energy, L.P. operates in the midstream segment of the crude oil and natural gas industry. The company's Offshore Pipeline Transportation segment engages in offshore crude oil and natural gas pipeline transportation and handling operations; and in the deep water pipeline servicing in the southern Keathley Canyon area of the Gulf of Mexico. This segment owns interests in approximately 1,422 miles of crude oil pipelines located offshore in the Gulf of Mexico. Its Sodium Minerals and Sulfur Services segment provides sulfur-extraction services to refining operations; and operates storage and transportation assets. This segment provides services to 10 refining operations; and sells sodium hydrosulfide and caustic soda to industrial and commercial companies involved in the mining of base metals. The company's Onshore Facilities and Transportation segment provides onshore facilities and transportation services to Gulf Coast crude oil refineries and producers by purchasing, transporting, storing, blending, and marketing crude oil and refined products. It operates a suite of approximately 200 trucks, 300 trailers, 397 railcars, and terminals and tankage with 4.3 million barrels of storage capacity in various locations along the Gulf Coast. This segment also transports crude oil and carbon dioxide (CO2). It owns four onshore crude oil pipeline systems with approximately 460 miles of pipe located primarily in Alabama, Florida, Louisiana, Mississippi, and Texas; and two CO2 pipelines with approximately 269 miles of pipe. Its Marine Transportation segment offers waterborne transportation of petroleum products and crude oil in North America. This segment owns a fleet of 91 barges with a combined transportation capacity of 3.2 million barrels; and 42 push/tow boats. In addition, the company produces natural soda ash. Genesis Energy, LLC serves as a general partner of the company. The company was founded in 1996 and is headquartered in Houston, Texas.",
  "Gibson Energy Inc., a crude oil infrastructure company, engages in the gathering, storage, optimization, processing, and marketing of crude oil and refined products in North America. It operates through Infrastructure and Marketing segments. The Infrastructure segment operates a network of infrastructure assets that include oil terminals, rail loading and unloading facilities, gathering pipelines, and a crude oil processing facility, as well as procession, recovery, and disposal terminals. The Marketing segment purchases, sells, stores, and optimizes hydrocarbon products, including crude oil, natural gas liquids, road asphalt, roofing flux, frac oils, light and heavy straight run distillates, combined vacuum gas oil, and an oil-based mud product. The company was formerly known as Gibson Energy Holdings ULC and changed its name to Gibson Energy Inc. in April 2011. Gibson Energy Inc. was founded in 1950 and is headquartered in Calgary, Canada.   Gibson Energy Inc., a crude oil infrastructure company, engages in the gathering, storage, optimization, processing, and marketing of crude oil and refined products in North America. It operates through Infrastructure and Marketing segments.",
  "Gibson Energy Inc., a crude oil infrastructure company, engages in the gathering, storage, optimization, processing, and marketing of crude oil and refined products in North America. It operates through Infrastructure and Marketing segments. The Infrastructure segment operates a network of infrastructure assets that include oil terminals, rail loading and unloading facilities, gathering pipelines, and a crude oil processing facility, as well as procession, recovery, and disposal terminals. The Marketing segment purchases, sells, stores, and optimizes hydrocarbon products, including crude oil, natural gas liquids, road asphalt, roofing flux, frac oils, light and heavy straight run distillates, combined vacuum gas oil, and an oil-based mud product. The company was formerly known as Gibson Energy Holdings ULC and changed its name to Gibson Energy Inc. in April 2011. Gibson Energy Inc. was founded in 1950 and is headquartered in Calgary, Canada.",
  "Global Partners LP, a midstream logistics and marketing company, distributes gasoline, distillates, residual oil, and renewable fuels to wholesalers, retailers, and commercial customers in the New England states and New York. It operates in three segments: Wholesale, Gasoline Distribution and Station Operations, and Commercial. The Wholesale segment sells home heating oil, branded and unbranded gasoline and gasoline blendstocks, diesel, kerosene, residual oil, and propane to home heating oil and propane retailers, and wholesale distributors. It also aggregates crude oil through truck or pipeline in the mid-continent region of the United States and Canada for distribution to refiners and other customers. The Gasoline Distribution and Station Operations segment sells branded and unbranded gasoline to gasoline station operators and sub-jobbers; operates gasoline stations and convenience stores; and provides car wash, lottery, and ATM services, as well as leases gasoline stations. As of December 31, 2017, this segment had a portfolio of 1,455 owned, leased, and/or supplied gasoline stations, which included 264 convenience stores in the Northeast, Maryland, and Virginia. The Commercial segment delivers unbranded gasoline, home heating oil, diesel, kerosene, residual oil, bunker fuel, and natural gas to end user customers in the public sector, as well as to commercial and industrial end users; and sells custom blended fuels. The company also owns, leases, or maintains storage facilities at 24 bulk terminals with a collective storage capacity of 10.1 million barrels. Global GP LLC serves as the general partner of the company. Global Partners LP was founded in 2005 and is based in Waltham, Massachusetts.   Global Partners LP, a midstream logistics and marketing company, distributes gasoline, distillates, residual oil, and renewable fuels to wholesalers, retailers, and commercial customers in the New England states and New York.",
  "Global Partners LP, a midstream logistics and marketing company, distributes gasoline, distillates, residual oil, and renewable fuels to wholesalers, retailers, and commercial customers in the New England states and New York. It operates in three segments: Wholesale, Gasoline Distribution and Station Operations, and Commercial. The Wholesale segment sells home heating oil, branded and unbranded gasoline and gasoline blendstocks, diesel, kerosene, residual oil, and propane to home heating oil and propane retailers, and wholesale distributors. It also aggregates crude oil through truck or pipeline in the mid-continent region of the United States and Canada for distribution to refiners and other customers. The Gasoline Distribution and Station Operations segment sells branded and unbranded gasoline to gasoline station operators and sub-jobbers; operates gasoline stations and convenience stores; and provides car wash, lottery, and ATM services, as well as leases gasoline stations. As of December 31, 2017, this segment had a portfolio of 1,455 owned, leased, and/or supplied gasoline stations, which included 264 convenience stores in the Northeast, Maryland, and Virginia. The Commercial segment delivers unbranded gasoline, home heating oil, diesel, kerosene, residual oil, bunker fuel, and natural gas to end user customers in the public sector, as well as to commercial and industrial end users; and sells custom blended fuels. The company also owns, leases, or maintains storage facilities at 24 bulk terminals with a collective storage capacity of 10.1 million barrels. Global GP LLC serves as the general partner of the company. Global Partners LP was founded in 2005 and is based in Waltham, Massachusetts.",
  "W. R. Grace & Co., through its subsidiaries, produces and sells specialty chemicals and materials worldwide. It operates through two segments, Grace Catalysts Technologies and Grace Materials Technologies. The Grace Catalysts Technologies segment offers fluid catalytic cracking (FCC) catalysts for the production of transportation fuels, such as gasoline and diesel fuels, and petrochemicals; and FCC additives. This segment also provides hydro processing catalysts used in process reactors to upgrade heavy oils into lighter products; polyolefin and chemical catalysts used for the production of polypropylene and polyethylene thermoplastic resins; and chemical catalysts, as well as gas-phase polypropylene process technology to manufacture polypropylene products. The Grace Materials Technologies segment offers silica-based and silica-alumina-based materials for use in consumer/pharma, coatings, and chemical process applications. W. R. Grace & Co. was founded in 1854 and is headquartered in Columbia, Maryland.",
  "GrafTech International Ltd. researches, develops, manufactures, and sells graphite and carbon based products worldwide. It offers graphite electrodes, which requires for the production of electric arc furnace steel, ferrous, and non-ferrous metals; and petroleum needle coke, a crystalline form of carbon used in the production of graphite electrodes. The company sells its products primarily through direct sales force, independent sales representatives, and distributors. The company was founded in 1886 and is headquartered in Brooklyn Heights, Ohio. GrafTech International Ltd. is a subsidiary of Brookfield Asset Management Inc.",
  "Granite Falls Energy, LLC produces and sells fuel-grade ethanol, distillers' grains, and non-edible corn oil in the United States. Its ethanol is a fuel component for the wholesale gasoline distributors or blenders, which is produced from corn and various other grains for use as an octane enhancer in fuels; an oxygenated fuel additive for reducing ozone and carbon monoxide vehicle emissions; a non-petroleum-based gasoline substitute; and a renewable fuel to displace consumption of imported oil. The company also provides distillers grains, a co-product of the ethanol production process that is used as an animal feed ingredient in the beef and dairy cattle, poultry, and hog markets; and corn oil, which is used primarily as a biodiesel feedstock and as a supplement for animal feed, as well as corn syrup, a by-product of the ethanol production process. In addition, it operates 190 miles of natural gas pipeline. The company markets and distributes its ethanol and distillers grains through its third party marketers; and sells corn oil to diesel manufacturers. Granite Falls Energy, LLC was founded in 2000 and is headquartered in Granite Falls, Minnesota.   Granite Falls Energy, LLC produces and sells fuel-grade ethanol, distillers' grains, and non-edible corn oil in the United States.",
  "Granite Falls Energy, LLC produces and sells fuel-grade ethanol, distillers' grains, and non-edible corn oil in the United States. Its ethanol is a fuel component for the wholesale gasoline distributors or blenders, which is produced from corn and various other grains for use as an octane enhancer in fuels; an oxygenated fuel additive for reducing ozone and carbon monoxide vehicle emissions; a non-petroleum-based gasoline substitute; and a renewable fuel to displace consumption of imported oil. The company also provides distillers grains, a co-product of the ethanol production process that is used as an animal feed ingredient in the beef and dairy cattle, poultry, and hog markets; and corn oil, which is used primarily as a biodiesel feedstock and as a supplement for animal feed, as well as corn syrup, a by-product of the ethanol production process. In addition, it operates 190 miles of natural gas pipeline. The company markets and distributes its ethanol and distillers grains through its third party marketers; and sells corn oil to diesel manufacturers. Granite Falls Energy, LLC was founded in 2000 and is headquartered in Granite Falls, Minnesota.",
  "Hawkins, Inc. blends, manufactures, and distributes chemicals and other specialty ingredients in the United States and internationally. It operates through three segments: Industrial, Water Treatment, and Health and Nutrition. The Industrial segment offers industrial chemicals, products, and services to agriculture, chemical processing, electronics, energy, food, pharmaceutical, and plating industries. This segment primarily provides acids, alkalis, and industrial and food-grade salts. It also receives, stores, and distributes various chemicals in bulk quantities, such as liquid caustic soda, sulfuric acid, hydrochloric acid, urea, phosphoric acid, aqua ammonia, and potassium hydroxide. In addition, this segment manufactures sodium hypochlorite and agricultural products, as well as various food-grade products that include liquid phosphates, lactates, and other blended products; repackages water treatment chemicals and bulk industrial chemicals; and performs custom blending of chemicals, and contract and private label bleach packaging. The Water Treatment segment offers chemicals, equipment, and solutions for potable water, municipal and industrial wastewater, industrial process water, and non-residential swimming pool and agriculture water. The Health and Nutrition segment offers ingredient distribution, processing, and formulation solutions to manufacturers of nutraceutical, functional food and beverage, personal care, dietary supplement and other nutritional food, and health and wellness products. Its products portfolio includes minerals, botanicals and herbs, vitamins and amino acids, excipients, joint products, sweeteners, and enzymes. The company was founded in 1938 and is headquartered in Roseville, Minnesota.",
  "Heron Lake BioEnergy, LLC produces and sells ethanol and co-products, and non-edible corn oil in the United States. It operates in two segments, Ethanol Production and Natural Gas Pipeline. The company offers fuel-grade ethanol, which is used as an octane enhancer in fuels; as an oxygenated fuel additive that could reduce ozone and carbon monoxide vehicle emissions; as a non-petroleum-based gasoline substitute; and as a renewable fuel to displace consumption of imported oil. It also provides distillers' grains, an animal feed ingredient primarily marketed to the dairy and beef industries; crude corn oil, which is used principally as a biodiesel feedstock and as a supplement for animal feed; and corn syrup primarily used as a feed additive to moisten dry feed stuffs, such as hay. In addition, the company operates a natural gas pipeline that provides natural gas to its ethanol production facility and other customers. It distributes and markets its products through third party marketers. The company was formerly known as Generation II, LLC and changed its name to Heron Lake BioEnergy, LLC in June 2004. The company was founded in 2001 and is headquartered in Heron Lake, Minnesota. As of January 29, 2020, Heron Lake BioEnergy, LLC operates as a subsidiary of Granite Falls Energy, LLC.",
  "Hexion Inc. provides thermoset technologies, specialty products, and technical support for a range of applications and industries in North America, Europe, the Asia Pacific, and Latin America. It operates through Adhesives; and Coatings and Composites segments. The Adhesives segment is involved in the wood adhesive business, including forest products resins and global formaldehyde; and global phenolic specialty resins business. The Coatings and Composites segment offers base and specialty epoxy resins, as well as engages in the Versatic acids and derivatives businesses. The company serves industrial/marine, construction, consumer/durable goods, automotive, wind energy, aviation, electronics, architectural, civil engineering, repair/remodeling, and oil and gas drilling sectors. It sells its products through its direct sales force and third-party distributors. The company was formerly known as Momentive Specialty Chemicals Inc. and changed its name to Hexion Inc. in January 2015. Hexion Inc. was founded in 1899 and is headquartered in Columbus, Ohio. Hexion Inc. is a subsidiary of Hexion Intermediate Holding 2, Inc.",
  "HollyFrontier Corporation operates as an independent petroleum refiner in the United States. The company operates through three segments: Refining, Lubricants and Specialty Products, and HEP. It primarily produces high-value light products, such as gasoline, diesel and jet fuel, and specialty lubricant products, as well as specialty and modified asphalt. The company offers its products to other refiners, convenience store chains, independent marketers, retailers, truck stop chains, wholesalers, railroads, governmental entities, and paving contractors or manufacturers, as well as for commercial airline use. It owns and operates 5 refineries with a combined crude oil processing capacity of approximately 457,000 barrels per day in El Dorado, Kansas; Tulsa, Oklahoma; Artesia, New Mexico; Cheyenne, Wyoming; and Woods Cross, Utah. The company also owns and operates vacuum distillation and other facilities in Lovington, New Mexico, as well as asphalt terminals in Arizona, New Mexico, and Oklahoma. Its refineries serve markets in the Mid-Continent, Southwest, and Rocky Mountain regions of the United States. In addition, HollyFrontier Corporation produces base oils and other specialized lubricant products; and owns and operates logistic assets consisting of petroleum product and crude oil pipelines, terminals, tankage, loading rack facilities, and refinery processing units. The company was formerly known as Holly Corporation and changed its name to HollyFrontier Corporation as a result of its merger with Frontier Oil Corporation in July 2011. HollyFrontier Corporation was founded in 1947 and is headquartered in Dallas, Texas.",
  "Honeywell International Inc. operates as a diversified technology and manufacturing company worldwide. The Aerospace segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; spare parts; repair, overhaul, and maintenance services; thermal systems; and connected solutions and data services for the aftermarket, as well as wireless connectivity, and management and technical services. The company's Honeywell Building Technologies segment offers advanced software applications for building control and optimization; sensors, switches, control systems and instruments for energy management; access control; video surveillance; fire products; remote patient monitoring systems; e-cooling heat transfer agents; and installation, maintenance, and upgrades of systems. Its Performance Materials and Technologies segment offers automation control, instrumentation, and advanced software and related services; catalysts and adsorbents, equipment, and consulting; and materials used to manufacture end products, such as bullet-resistant armor, nylon, computer chips, and pharmaceutical packaging, as well as Honeywell forge connected solutions. The company's Safety and Productivity Solutions segment provides personal protection equipment, apparel, gear, and footwear; gas detection technology; and cloud-based notification and emergency messaging; and mobile devices and software; supply chain and warehouse automation equipment, and software and solutions; custom-engineered sensors, switches, and controls; and software-based data and asset management productivity solutions. Honeywell International Inc. was incorporated in 1985 and is headquartered in Charlotte, North Carolina.",
  "Huntsman Corporation manufactures and sells differentiated organic chemical products worldwide. The company operates in four segments: Polyurethanes, Performance Products, Advanced Materials, and Textile Effects. The Polyurethanes segment offers polyurethane chemicals, including methyl diphenyl diisocyanate, polyols, thermoplastic polyurethane, propylene oxide, and methyl tertiary-butyl ether products. The Performance Products segment manufactures specialty amines, ethyleneamines, and maleic anhydrides, and technology licenses. The Advanced Materials segment offers epoxy, acrylic, and polyurethane-based polymers formulations; high performance thermoset resins and curing agents; and base liquid and solid resins. The Textile Effects segment provides textile chemicals, dyes, and inks. The company's products are used in a range of applications, including adhesives, aerospace, automotive, construction products, personal care and hygiene, durable and non-durable consumer products, digital inks, electronics, insulation, medical, packaging, coatings and construction, power generation, refining, synthetic fiber, textile chemicals, and dye industries. Huntsman Corporation was founded in 1970 and is headquartered in The Woodlands, Texas.   Huntsman Corporation manufactures and sells differentiated organic chemical products worldwide. The company operates in four segments: Polyurethanes, Performance Products, Advanced Materials, and Textile Effects.",
  "Huntsman Corporation manufactures and sells differentiated organic chemical products worldwide. The company operates in four segments: Polyurethanes, Performance Products, Advanced Materials, and Textile Effects. The Polyurethanes segment offers polyurethane chemicals, including methyl diphenyl diisocyanate, polyols, thermoplastic polyurethane, propylene oxide, and methyl tertiary-butyl ether products. The Performance Products segment manufactures specialty amines, ethyleneamines, and maleic anhydrides, and technology licenses. The Advanced Materials segment offers epoxy, acrylic, and polyurethane-based polymers formulations; high performance thermoset resins and curing agents; and base liquid and solid resins. The Textile Effects segment provides textile chemicals, dyes, and inks. The company's products are used in a range of applications, including adhesives, aerospace, automotive, construction products, personal care and hygiene, durable and non-durable consumer products, digital inks, electronics, insulation, medical, packaging, coatings and construction, power generation, refining, synthetic fiber, textile chemicals, and dye industries. Huntsman Corporation was founded in 1970 and is headquartered in The Woodlands, Texas.",
  "Husky Energy Inc., together with its subsidiaries, operates as an integrated energy company in the United States, Western and Atlantic Canada, and the Asia Pacific. It operates through two segments, Integrated Corridor and Offshore. The company engages in the exploration for, and development and production of crude oil, bitumen, natural gas, and natural gas liquids (NGL); marketing of the company's and other producers' crude oil, natural gas, NGL, sulphur, and petroleum coke; pipeline transportation and blending of crude oil and natural gas; and storage of crude oil, diluent, and natural gas. It is also involved in upgrading heavy crude oil feedstock into synthetic crude oil and diesel; refining crude oil; marketing refined petroleum products, including gasoline, diesel, ethanol blended fuels, asphalt, lubricants, and ancillary products; and producing ethanol, as well as refining crude oil to produce and market diesel fuels, gasoline, jet fuel, and asphalt. Husky Energy Inc. was founded in 1938 and is headquartered in Calgary, Canada.   Husky Energy Inc., together with its subsidiaries, operates as an integrated energy company in the United States, Western and Atlantic Canada, and the Asia Pacific. It operates through two segments, Integrated Corridor and Offshore.",
  "Husky Energy Inc., together with its subsidiaries, operates as an integrated energy company in the United States, Western and Atlantic Canada, and the Asia Pacific. It operates through two segments, Integrated Corridor and Offshore. The company engages in the exploration for, and development and production of crude oil, bitumen, natural gas, and natural gas liquids (NGL); marketing of the company's and other producers' crude oil, natural gas, NGL, sulphur, and petroleum coke; pipeline transportation and blending of crude oil and natural gas; and storage of crude oil, diluent, and natural gas. It is also involved in upgrading heavy crude oil feedstock into synthetic crude oil and diesel; refining crude oil; marketing refined petroleum products, including gasoline, diesel, ethanol blended fuels, asphalt, lubricants, and ancillary products; and producing ethanol, as well as refining crude oil to produce and market diesel fuels, gasoline, jet fuel, and asphalt. Husky Energy Inc. was founded in 1938 and is headquartered in Calgary, Canada.",
  "Imperial Oil Limited explores for, produces, and sells crude oil and natural gas in Canada. It operates through three segments: Upstream, Downstream, and Chemical. The Upstream segment explores for and produces crude oil, natural gas, synthetic oil, and bitumen. As of December 31, 2019, this segment had 397 million oil-equivalent barrels of proved undeveloped reserves. The Downstream segment is involved in the transportation and refining of crude oil, as well as blending, distribution, and marketing of refined products. It also transports crude oil to refineries by contracted pipelines, common carrier pipelines, and rail; maintains a distribution system to move petroleum products to market by pipeline, tanker, rail, and road transport; and owns and operates fuel terminals, natural gas liquids, and products pipelines in Alberta, Manitoba, and Ontario. In addition, this segment markets and supplies petroleum products to motoring public through approximately 2,300 Esso and Mobil-branded sites. Further, it sells petroleum products, including fuel, asphalt, and lubricants for industrial and transportation customers, independent marketers, and resellers, as well as other refiners serving the agriculture, residential heating, and commercial markets through branded fuel and lubricant resellers. The Chemical segment manufactures and markets various petrochemicals and polyethylene, such as benzene, aromatic, and aliphatic solvents; plasticizer intermediates; and polyethylene resins. The company was founded in 1880 and is headquartered in Calgary, Canada. Imperial Oil Limited is a subsidiary of Exxon Mobil Corporation.",
  "Ingevity Corporation manufactures and sells specialty chemicals and activated carbon materials in North America, Europe, the Asia-Pacific, and internationally. The company operates through two segments, Performance Materials and Performance Chemicals. The Performance Materials segment engineers, manufactures, and sells hardwood-based and chemically activated carbon products primarily for use in gasoline vapor emission control systems in cars, trucks, motorcycles, and boats. This segment also produces other activated carbon products for use in various applications, including food, water, beverage, and chemical purification. The Performance Chemicals segment develops, manufactures, and sells a range of specialty chemicals derived from co-products of the kraft pulping process and caprolactone monomers. This segment's products are used in various applications comprising pavement preservation, pavement adhesion promotion, and warm mix paving; oil well service additives, oil production, and downstream application chemicals; printing inks, adhesives, agrochemicals, lubricants, and industrial intermediates; and coatings, resins, elastomers, and bio-plastics. Ingevity Corporation was incorporated in 2015 and is headquartered in North Charleston, South Carolina.",
  "Innospec Inc. develops, manufactures, blends, markets, and supplies specialty chemicals worldwide. It operates through four segments: Fuel Specialties, Performance Chemicals, Oilfield Services, and Octane Additives. The Fuel Specialties segment offers a range of specialty chemical products used as additives in various fuels. Its products are used in the operation of automotive, marine, and aviation engines; power station generators; and heating oil. The Performance Chemicals segment provides technology-based solutions for its customers' processes or products focused in the personal care, home care, agrochemical, and metal extraction markets. The Oilfield Services segment develops and markets products to prevent loss of mud in drilling operations; chemical solutions for fracturing, stimulation, and completion operations; and products for oil and gas production, which enable flow assurance and maintain asset integrity. The Octane Additives segment produces and sells tetra ethyl lead (TEL) for use in automotive gasoline. This segment is also involved in environmental remediation business that manages the cleanup of redundant TEL facilities. The company sells its products primarily to oil and gas exploration and production companies, oil refineries, fuel manufacturers and users, personal care and home care companies, formulators of agrochemical and metal extraction preparations, and other chemical and industrial companies. The company was formerly known as Octel Corp. and changed its name to Innospec Inc. in January 2006. Innospec Inc. was founded in 1938 and is headquartered in Englewood, Colorado.   Innospec Inc. develops, manufactures, blends, markets, and supplies specialty chemicals worldwide. It operates through four segments: Fuel Specialties, Performance Chemicals, Oilfield Services, and Octane Additives.",
  "Innospec Inc. develops, manufactures, blends, markets, and supplies specialty chemicals worldwide. It operates through four segments: Fuel Specialties, Performance Chemicals, Oilfield Services, and Octane Additives. The Fuel Specialties segment offers a range of specialty chemical products used as additives in various fuels. Its products are used in the operation of automotive, marine, and aviation engines; power station generators; and heating oil. The Performance Chemicals segment provides technology-based solutions for its customers' processes or products focused in the personal care, home care, agrochemical, and metal extraction markets. The Oilfield Services segment develops and markets products to prevent loss of mud in drilling operations; chemical solutions for fracturing, stimulation, and completion operations; and products for oil and gas production, which enable flow assurance and maintain asset integrity. The Octane Additives segment produces and sells tetra ethyl lead (TEL) for use in automotive gasoline. This segment is also involved in environmental remediation business that manages the cleanup of redundant TEL facilities. The company sells its products primarily to oil and gas exploration and production companies, oil refineries, fuel manufacturers and users, personal care and home care companies, formulators of agrochemical and metal extraction preparations, and other chemical and industrial companies. The company was formerly known as Octel Corp. and changed its name to Innospec Inc. in January 2006. Innospec Inc. was founded in 1938 and is headquartered in Englewood, Colorado.",
  "International Flavors & Fragrances Inc., together with its subsidiaries, manufactures flavors and fragrances for use in various consumer products. It operates through two segments, Taste and Scent. The Taste segment offers flavor compounds primarily to the food and beverage industries for use in consumer products, such as prepared foods, beverages, dairy, food, and sweet products. This segment also creates and manufactures a naturals-focused suite of flavor compounds, functional foods, and specialty fine ingredients to small, local, and regional customers. The Scent segment provides fragrance compounds, which include fine fragrances comprising perfumes and colognes, as well as consumer fragrances for personal care, household products, and beauty care; fragrance ingredients comprising synthetic and natural ingredients that could be combined with other materials to create fragrance and consumer compounds; and cosmetic active ingredients consisting of active and functional ingredients, botanicals, and delivery systems to support its customers' cosmetic and personal care product lines. This segment serves perfume and toiletries manufacturers in the cosmetics industry; and manufacturers of soaps, detergents, fabric care, household cleaners, and air fresheners in the household products industry. The company has operations in Europe, Africa, the Middle East, Greater Asia, North America, and Latin America. International Flavors & Fragrances Inc. was founded in 1833 and is headquartered in New York, New York.",
  "Just Energy Group Inc., through its subsidiaries, provides electricity and natural gas commodities in the United States, Canada, and internationally. It operates through Consumer and Commercial segments. The company offers longer-term price-protected, flat-bill, and variable rate product offerings, as well as Just Green products; smart thermostats; and subscription-based home water filtration systems, including under-counter and whole-home water filtration solution It also provides business electricity and natural gas plans, LED retrofit solutions, smart building controls, commercial energy rates, affinity programs, energy monitoring and sub-metering products, energy analytics solutions, HVAC control system, and lighting controls. The company serves residential and commercial customers through brokers, door-to-door commercial independent contractors, and inside commercial sales representatives. Just Energy Group Inc. was founded in 1997 and is based in Toronto, Canada.   Just Energy Group Inc., through its subsidiaries, provides electricity and natural gas commodities in the United States, Canada, and internationally. It operates through Consumer and Commercial segments.",
  "Just Energy Group Inc., through its subsidiaries, provides electricity and natural gas commodities in the United States, Canada, and internationally. It operates through Consumer and Commercial segments. The company offers longer-term price-protected, flat-bill, and variable rate product offerings, as well as Just Green products; smart thermostats; and subscription-based home water filtration systems, including under-counter and whole-home water filtration solution It also provides business electricity and natural gas plans, LED retrofit solutions, smart building controls, commercial energy rates, affinity programs, energy monitoring and sub-metering products, energy analytics solutions, HVAC control system, and lighting controls. The company serves residential and commercial customers through brokers, door-to-door commercial independent contractors, and inside commercial sales representatives. Just Energy Group Inc. was founded in 1997 and is based in Toronto, Canada.",
  "Koppers Holdings Inc. provides treated wood products, wood treatment chemicals, and carbon compounds in the United States, Australasia, Europe, and internationally. The company operates through three segments: Railroad and Utility Products and Services (RUPS), Performance Chemicals (PC), and Carbon Materials and Chemicals (CMC). The RUPS segment procures and treats crossties, switch ties, and various types of lumber used for railroad bridges and crossings. It also provides rail joint bars to join rails together for railroads; transmission and distribution poles for electric and telephone utilities; and pilings. This segment also provides railroad services, such as engineering, design, repair, and inspection services for railroad bridges. The PC segment develops, manufactures, and markets copper-based wood preservatives, including micronized copper quaternary and micronized copper azole, micronized pigments, alkaline copper quaternary, amine copper azole, and chromated copper arsenate for decking, fencing, utility poles, construction lumber and timbers, and vineyard stakes; water-based wood preservatives and wood specialty additives; and supplies fire-retardant chemicals for pressure treatment of wood primarily in commercial construction. The CMC segment manufactures creosote for use in the treatment of wood or as a feedstock in the production of carbon black; carbon pitch, a raw material used in the production of aluminum and steel; naphthalene for use as a feedstock in the production of phthalic anhydride and as a surfactant in the production of concrete; phthalic anhydride for the production of plasticizers, polyester resins, and alkyd paints; and carbon black feedstock for use in the production of carbon black. The company serves the railroad, specialty chemical, utility, residential lumber, agriculture, aluminum, steel, rubber, and construction industries. Koppers Holdings Inc. was founded in 1988 and is headquartered in Pittsburgh, Pennsylvania.   Koppers Holdings Inc. provides treated wood products, wood treatment chemicals, and carbon compounds in the United States, Australasia, Europe, and internationally.",
  "Koppers Holdings Inc. provides treated wood products, wood treatment chemicals, and carbon compounds in the United States, Australasia, Europe, and internationally. The company operates through three segments: Railroad and Utility Products and Services (RUPS), Performance Chemicals (PC), and Carbon Materials and Chemicals (CMC). The RUPS segment procures and treats crossties, switch ties, and various types of lumber used for railroad bridges and crossings. It also provides rail joint bars to join rails together for railroads; transmission and distribution poles for electric and telephone utilities; and pilings. This segment also provides railroad services, such as engineering, design, repair, and inspection services for railroad bridges. The PC segment develops, manufactures, and markets copper-based wood preservatives, including micronized copper quaternary and micronized copper azole, micronized pigments, alkaline copper quaternary, amine copper azole, and chromated copper arsenate for decking, fencing, utility poles, construction lumber and timbers, and vineyard stakes; water-based wood preservatives and wood specialty additives; and supplies fire-retardant chemicals for pressure treatment of wood primarily in commercial construction. The CMC segment manufactures creosote for use in the treatment of wood or as a feedstock in the production of carbon black; carbon pitch, a raw material used in the production of aluminum and steel; naphthalene for use as a feedstock in the production of phthalic anhydride and as a surfactant in the production of concrete; phthalic anhydride for the production of plasticizers, polyester resins, and alkyd paints; and carbon black feedstock for use in the production of carbon black. The company serves the railroad, specialty chemical, utility, residential lumber, agriculture, aluminum, steel, rubber, and construction industries. Koppers Holdings Inc. was founded in 1988 and is headquartered in Pittsburgh, Pennsylvania.",
  "Kronos Worldwide, Inc. produces and markets titanium dioxide pigments (TiO2) in Europe, North America, the Asia Pacific, and internationally. The company produces TiO2 in two crystalline forms, rutile and anatase to impart whiteness, brightness, opacity, and durability for various products, including paints, coatings, plastics, paper, fibers, and ceramics, as well as for various specialty products, such as inks, foods, and cosmetics. It also produces ilmenite, a raw material used directly as a feedstock by sulfate-process TiO2 plants; iron-based chemicals, which are used as treatment and conditioning agents for industrial effluents and municipal wastewater, as well as in the manufacture of iron pigments, cement, and agricultural products; titanium oxychloride for use in the formulation of pearlescent pigments, and production of electroceramic capacitors for cell phones and other electronic devices; and titanyl sulfate that is used in pearlescent pigments, natural gas pipe, and other specialty applications. In addition, the company provides technical services for its products. It sells its products under the KRONOS brand through agents and distributors to paint, plastics, decorative laminate, and paper manufacturers. The company was founded in 1916 and is headquartered in Dallas, Texas. Kronos Worldwide, Inc. is a subsidiary of Valhi, Inc.   Kronos Worldwide, Inc. produces and markets titanium dioxide pigments (TiO2) in Europe, North America, the Asia Pacific, and internationally.",
  "Kronos Worldwide, Inc. produces and markets titanium dioxide pigments (TiO2) in Europe, North America, the Asia Pacific, and internationally. The company produces TiO2 in two crystalline forms, rutile and anatase to impart whiteness, brightness, opacity, and durability for various products, including paints, coatings, plastics, paper, fibers, and ceramics, as well as for various specialty products, such as inks, foods, and cosmetics. It also produces ilmenite, a raw material used directly as a feedstock by sulfate-process TiO2 plants; iron-based chemicals, which are used as treatment and conditioning agents for industrial effluents and municipal wastewater, as well as in the manufacture of iron pigments, cement, and agricultural products; titanium oxychloride for use in the formulation of pearlescent pigments, and production of electroceramic capacitors for cell phones and other electronic devices; and titanyl sulfate that is used in pearlescent pigments, natural gas pipe, and other specialty applications. In addition, the company provides technical services for its products. It sells its products under the KRONOS brand through agents and distributors to paint, plastics, decorative laminate, and paper manufacturers. The company was founded in 1916 and is headquartered in Dallas, Texas. Kronos Worldwide, Inc. is a subsidiary of Valhi, Inc.",
  "Livent Corporation manufactures and sells performance lithium based batteries, specialty polymer, and chemical synthesis applications in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company offers lithium compounds for use in applications that have specific performance requirements, including battery-grade lithium hydroxide for use in high performance lithium-ion batteries; and butyllithium, which is used in the production of polymers and pharmaceutical products, as well as a range of specialty lithium compounds, including high purity lithium metal, which is used in the production of lightweight materials for aerospace applications and non-rechargeable batteries. It also provides lithium phosphate, pharmaceutical-grade lithium carbonate, high purity lithium chloride, and specialty organics; and lithium carbonate and lithium chloride for use as feedstock in the process of producing performance lithium compounds. The company was incorporated in 2018 and is headquartered in Philadelphia, Pennsylvania. Livent Corporation is a subsidiary of FMC Corporation.",
  "Marathon Petroleum Corporation, together with its subsidiaries, engages in refining, marketing, retailing, and transporting petroleum products primarily in the United States. It operates through three segments: Refining & Marketing, Retail, and Midstream. The Refining & Marketing segment refines crude oil and other feed stocks at its 16 refineries in the West Coast, Gulf Coast, and Mid-Continent regions of the United States; and purchases refined products and ethanol for resale. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures aromatics, propane, propylene, and sulfur. It sells refined products wholesale marketing customers domestically and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets. The Retail segment sells transportation fuels and convenience products in the retail market through company-owned and operated convenience stores, primarily under the Speedway brand; and long-term fuel supply contracts with direct dealers who operate locations mainly under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. The company also exports its refined products. As of December 31, 2019, it owned, leased, and had ownership interests in approximately 17,200 miles of crude oil and refined product pipelines, as well as owned and operated 3,900 convenience stores; and had 6,900 retail outlets operated by independent entrepreneurs in 35 states of the United States, the District of Columbia, and Mexico. The company was founded in 1887 and is headquartered in Findlay, Ohio.   Marathon Petroleum Corporation, together with its subsidiaries, engages in refining, marketing, retailing, and transporting petroleum products primarily in the United States. It operates through three segments: Refining & Marketing, Retail, and Midstream.",
  "Marathon Petroleum Corporation, together with its subsidiaries, engages in refining, marketing, retailing, and transporting petroleum products primarily in the United States. It operates through three segments: Refining & Marketing, Retail, and Midstream. The Refining & Marketing segment refines crude oil and other feed stocks at its 16 refineries in the West Coast, Gulf Coast, and Mid-Continent regions of the United States; and purchases refined products and ethanol for resale. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures aromatics, propane, propylene, and sulfur. It sells refined products wholesale marketing customers domestically and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets. The Retail segment sells transportation fuels and convenience products in the retail market through company-owned and operated convenience stores, primarily under the Speedway brand; and long-term fuel supply contracts with direct dealers who operate locations mainly under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. The company also exports its refined products. As of December 31, 2019, it owned, leased, and had ownership interests in approximately 17,200 miles of crude oil and refined product pipelines, as well as owned and operated 3,900 convenience stores; and had 6,900 retail outlets operated by independent entrepreneurs in 35 states of the United States, the District of Columbia, and Mexico. The company was founded in 1887 and is headquartered in Findlay, Ohio.",
  "Martin Marietta Materials, Inc., a natural resource-based building materials company, supplies aggregates and heavy building materials to the construction industry in the United States and internationally. It offers crushed stone, sand, and gravel products; ready mixed concrete and asphalt; paving products and services; Portland and specialty cement used in the infrastructure projects, and nonresidential and residential construction markets, as well as in the railroad, agricultural, utility, and environmental industries. The company also manufactures and markets magnesia-based chemical products for the industrial, agricultural, and environmental applications; and dolomitic lime primarily for customers in the steel and mining industries, as well as provides road paving construction services. Its chemical products are used in flame retardants, wastewater treatment, pulp and paper production, and other environmental applications. The company was founded in 1993 and is headquartered in Raleigh, North Carolina.",
  "Martin Midstream Partners L.P. engages in the terminalling, processing, storage, and packaging of petroleum products and by-products in the United States Gulf Coast region. The company's Terminalling and Storage segment owns or operates 19 marine shore-based terminal facilities and 12 specialty terminal facilities that provide storage, refining, blending, packaging, and handling services for producers and suppliers of petroleum products and by-products. This segment also offers land rental services to oil and gas companies, as well as storage and handling services for lubricants and fuels. Its Transportation segment operates a fleet of 540 tank trucks and 1,275 trailers; and 33 inland marine tank barges, 19 inland push boats, and 1 articulated offshore tug and barge unit to transport petroleum products and by-products, petrochemicals, and chemicals. The company's Sulfur Services segment processes molten sulfur into prilled or pelletized sulfur, which is used in the production of fertilizers and industrial chemicals. This segment also owns 23 railcars and leases 41 railcars to transport molten sulfur; and leases 132 railcars to transport fertilizer products. Its Natural Gas Liquids segment stores, distributes, and transports natural gas liquids for wholesale deliveries to refineries, industrial NGL users, and propane retailers, as well as owns approximately 2.1 million barrels of underground storage capacity for NGLs. Martin Midstream GP LLC serves as a general partner of the company. Martin Midstream Partners L.P. was founded in 2002 and is based in Kilgore, Texas.   Martin Midstream Partners L.P. engages in the terminalling, processing, storage, and packaging of petroleum products and by-products in the United States Gulf Coast region.",
  "Martin Midstream Partners L.P. engages in the terminalling, processing, storage, and packaging of petroleum products and by-products in the United States Gulf Coast region. The company's Terminalling and Storage segment owns or operates 19 marine shore-based terminal facilities and 12 specialty terminal facilities that provide storage, refining, blending, packaging, and handling services for producers and suppliers of petroleum products and by-products. This segment also offers land rental services to oil and gas companies, as well as storage and handling services for lubricants and fuels. Its Transportation segment operates a fleet of 540 tank trucks and 1,275 trailers; and 33 inland marine tank barges, 19 inland push boats, and 1 articulated offshore tug and barge unit to transport petroleum products and by-products, petrochemicals, and chemicals. The company's Sulfur Services segment processes molten sulfur into prilled or pelletized sulfur, which is used in the production of fertilizers and industrial chemicals. This segment also owns 23 railcars and leases 41 railcars to transport molten sulfur; and leases 132 railcars to transport fertilizer products. Its Natural Gas Liquids segment stores, distributes, and transports natural gas liquids for wholesale deliveries to refineries, industrial NGL users, and propane retailers, as well as owns approximately 2.1 million barrels of underground storage capacity for NGLs. Martin Midstream GP LLC serves as a general partner of the company. Martin Midstream Partners L.P. was founded in 2002 and is based in Kilgore, Texas.",
  "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahine brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
  "Methanex Corporation produces and supplies methanol in North America, the Asia Pacific, Europe, and South America. It also purchases methanol produced by others under methanol offtake contracts and on the spot market. In addition, the company owns and leases storage and terminal facilities. It owns and manages a fleet of approximately 30 ocean-going vessels. The company serves chemical and petrochemical producers. Methanex Corporation was founded in 1968 and is headquartered in Vancouver, Canada.",
  "NewMarket Corporation, through its subsidiaries, engages in the petroleum additives businesses. The company offers lubricant additives for use in various vehicle and industrial applications, including engine oils, transmission fluids, off-road powertrain and hydraulic systems, gear oils, hydraulic oils, turbine oils, and other applications where metal-to-metal moving parts are utilized; and engine oil, driveline, and industrial additives. It also provides engine oil additives comprising driveline additives for products, such as transmission fluids, axle fluids, and off-road powertrain fluids; and industrial additive comprising products for industrial applications, which include hydraulic fluids, grease, and industrial gear fluids, as well as industrial specialty applications, including turbine oils. In addition, the company offers fuel additives that are used to enhance the oil refining process and the performance of gasoline, diesel, biofuels, and other fuels to industry, government, original equipment manufacturers, and individual customers. Additionally, it engages in the antiknock compounds business, as well as contracted manufacturing and services business. The company has operations in the United States, Europe, the Asia Pacific, India, Latin America, Canada, Africa, and the Middle East. NewMarket Corporation was founded in 1887 and is headquartered in Richmond, Virginia.",
  "Newpark Resources, Inc. supplies products, rentals, and services primarily to the oil and natural gas exploration and production industry. The company operates through two segments, Fluids Systems; and Mats and Integrated Services. The Fluids Systems segment offers drilling and completion fluids products, technical services, and other minerals to customers in the North America, Europe, the Middle East, Africa, Latin America, and the Asia Pacific regions. The Mats and Integrated Services segment offers composite mat rental, construction, and related site services to customers in various markets, including oil and gas exploration and production, electrical transmission and distribution, pipeline, solar, petrochemical, and construction industries in North America and Europe. This segment also provides access road construction, site planning and preparation, environmental protection, fluids and spill containment, erosion control, and site restoration services. Newpark Resources, Inc. was founded in 1932 and is headquartered in The Woodlands, Texas.",
  "NGL Energy Partners LP engages in the crude oil logistics, water solutions, and liquids and refined products businesses. The company's Crude Oil Logistics segment purchases crude oil from producers and marketers, and transports it to refineries for resale at pipeline injection stations, storage terminals, barge loading facilities, rail facilities, refineries, and other trade hubs; and provides storage, terminaling, and pipeline transportation services. Its Water Solutions segment is involved in the treatment and disposal of flowback water generated from crude oil and natural gas production; disposal of solids, such as tank bottoms, drilling fluids, and drilling muds, as well as performs truck and frac tank washouts; and sale of brackish non-potable water. The company's Liquids and Refined Products segment markets natural gas liquids, gasoline, diesel, propane, butane, refined petroleum, and biodiesel to retailers, wholesalers, refiners, and petrochemical plants in the United States and Canada through its 28 terminals; and purchase and delivers refined petroleum and renewable products, as well as offers terminaling and storage services. NGL Energy Holdings LLC serves as the general partner of the company. The company was founded in 1940 and is headquartered in Tulsa, Oklahoma.   NGL Energy Partners LP engages in the crude oil logistics, water solutions, and liquids and refined products businesses.",
  "NGL Energy Partners LP engages in the crude oil logistics, water solutions, and liquids and refined products businesses. The company's Crude Oil Logistics segment purchases crude oil from producers and marketers, and transports it to refineries for resale at pipeline injection stations, storage terminals, barge loading facilities, rail facilities, refineries, and other trade hubs; and provides storage, terminaling, and pipeline transportation services. Its Water Solutions segment is involved in the treatment and disposal of flowback water generated from crude oil and natural gas production; disposal of solids, such as tank bottoms, drilling fluids, and drilling muds, as well as performs truck and frac tank washouts; and sale of brackish non-potable water. The company's Liquids and Refined Products segment markets natural gas liquids, gasoline, diesel, propane, butane, refined petroleum, and biodiesel to retailers, wholesalers, refiners, and petrochemical plants in the United States and Canada through its 28 terminals; and purchase and delivers refined petroleum and renewable products, as well as offers terminaling and storage services. NGL Energy Holdings LLC serves as the general partner of the company. The company was founded in 1940 and is headquartered in Tulsa, Oklahoma.",
  "NuStar Energy L.P. engages in the terminalling, storage, and marketing of petroleum products in the United States and internationally. The company also engages in the transportation of petroleum products and anhydrous ammonia. It operates through three segments: Pipeline, Storage, and Fuels Marketing. The Pipeline segment transports refined petroleum products, crude oil, and anhydrous ammonia. The Storage segment owns terminal and storage facilities, which offer storage, handling, and other services for petroleum products, crude oil, specialty chemicals, and other liquids. This segment also provides pilotage, tug assistance, line handling, launch, emergency response, and other ship services. The Fuels Marketing segment is involved in bunkering operations in the Gulf Coast; blending operations; and purchase of petroleum products for resale. As of December 31, 2019, the company had 3,205 miles of refined product pipelines and 2,155 miles of crude oil pipelines in Texas, Oklahoma, Kansas, Colorado, and New Mexico; a 2,150-mile refined product pipeline originating in southern Kansas and terminating at Jamestown, North Dakota; a 450-mile refined product pipeline originating at Marathon Petroleum Corporation's Mandan, North Dakota refinery and terminating in Minneapolis, Minnesota; 2,000 miles of anhydrous ammonia pipelines; and 40 terminal and storage facilities, which offer approximately 61.3 million barrels of storage capacity. NuStar Energy L.P. was founded in 1999 and is headquartered in San Antonio, Texas.   NuStar Energy L.P. engages in the terminalling, storage, and marketing of petroleum products in the United States and internationally. The company also engages in the transportation of petroleum products and anhydrous ammonia.",
  "NuStar Energy L.P. engages in the terminalling, storage, and marketing of petroleum products in the United States and internationally. The company also engages in the transportation of petroleum products and anhydrous ammonia. It operates through three segments: Pipeline, Storage, and Fuels Marketing. The Pipeline segment transports refined petroleum products, crude oil, and anhydrous ammonia. The Storage segment owns terminal and storage facilities, which offer storage, handling, and other services for petroleum products, crude oil, specialty chemicals, and other liquids. This segment also provides pilotage, tug assistance, line handling, launch, emergency response, and other ship services. The Fuels Marketing segment is involved in bunkering operations in the Gulf Coast; blending operations; and purchase of petroleum products for resale. As of December 31, 2019, the company had 3,205 miles of refined product pipelines and 2,155 miles of crude oil pipelines in Texas, Oklahoma, Kansas, Colorado, and New Mexico; a 2,150-mile refined product pipeline originating in southern Kansas and terminating at Jamestown, North Dakota; a 450-mile refined product pipeline originating at Marathon Petroleum Corporation's Mandan, North Dakota refinery and terminating in Minneapolis, Minnesota; 2,000 miles of anhydrous ammonia pipelines; and 40 terminal and storage facilities, which offer approximately 61.3 million barrels of storage capacity. NuStar Energy L.P. was founded in 1999 and is headquartered in San Antonio, Texas.",
  "Olin Corporation manufactures and distributes chemical products in the United States and internationally. It operates through three segments: Chlor Alkali Products and Vinyls; Epoxy; and Winchester. The Chlor Alkali Products and Vinyls segment offers chlorine and caustic soda, ethylene dichloride and vinyl chloride monomers, methyl chloride, methylene chloride, chloroform, carbon tetrachloride, perchloroethylene, trichloroethylene and vinylidene chloride, hydrochloric acid, hydrogen, bleach products, potassium hydroxide, chlorinated organics intermediates and solvents, and sodium hypochlorite. The Epoxy segment provides allyl chloride and epichlorohydrin, as well as acetone, bisphenol, cumene, and phenol for use in resins and other plastic materials, water purification, and pesticides, as well as for the manufacturers of polymers; liquid and solid epoxy resins that are used in adhesives, paints and coatings, composites, and flooring; and differentiated epoxy resins for use in electrical laminates, paints and coatings, wind blades, electronics, and construction, as well as offers additives. The Winchester segment offers sporting ammunition products, including shotshells, small caliber centerfire, and rimfire ammunition products for hunters and recreational shooters, and law enforcement agencies; small caliber military ammunition products for use in infantry and mounted weapons; and industrial products comprising gauge loads and powder-actuated tool loads for maintenance applications in power and concrete industries, and construction industry. It markets its products through its sales force, as well as directly to various industrial customers, mass merchants, retailers, wholesalers, other distributors, and the U.S. Government and its prime contractors. The company was founded in 1892 and is based in Clayton, Missouri.",
  "Par Pacific Holdings, Inc. owns, manages, and maintains interests in energy and infrastructure businesses. The company operates in three segments: Refining, Retail, and Logistics. The Refining segment operates four refineries that produces ultra-low sulfur diesel, gasoline, jet fuel, marine fuel, distillate, asphalt, low sulfur fuel oil, and other associated refined products primarily for consumption in Hawaii, Pacific Northwest, Wyoming, and South Dakota. The Retail segment operates retail outlets, which sell gasoline, diesel, and retail merchandise in the island of Oahu, Maui, Hawaii, and Kauai. It operates 124 outlets under the Hele, 76, nomnom, Cenex, and Zip Trip brand names in Hawaii, Washington, and Idaho. The Logistics segment owns and operates terminals, pipelines, a single-point mooring, and trucking operations to distribute refined products throughout the island of Oahu, Maui, Hawaii, Molokai, and Kauai. It also owns and operates a crude oil pipeline gathering system, a refined products pipeline, and storage facilities and loading racks in Wyoming; and a jet fuel storage facility and pipeline that serves Ellsworth Air Force Base in South Dakota. In addition, this segment owns and operates a marine terminal, a unit train-capable rail loading terminal, storage facilities, a truck rack, and a proprietary pipeline that serves McChord Air Force Base in Washington. The company was formerly known as Par Petroleum Corporation and changed its name to Par Pacific Holdings, Inc. in October 2015. Par Pacific Holdings, Inc. was founded in 1984 and is headquartered in Houston, Texas.",
  "Parkland Corporation operates as a marketer, distributor, and refiner of fuel and petroleum products in Canada, the United States, and internationally. The company operates in five segments: Canada Retail, Canada Commercial, USA, Supply, and International. The Canada Retail segment supplies and supports a coast-to-coast network of 1,863 retail gas stations under the Ultramar, Esso, Fas Gas Plus, Chevron, and Pioneer, as well as operates convenience stores under the On the Run/Marche Express brand. The Canada Commercial segment offers bulk fuel, bulk and cylinder exchange propane, heating oil, lubricants, and other related products and services to commercial, industrial, and residential customers in various industries, such as oil and gas, construction, mining, forestry, fishing, and transportation under the Ultramar, Bluewave Energy, Pipeline Commercial, Chevron, Columbia Fuels, and Sparlings Propane brands. The USA segment operates a network of gas stations; and delivers bulk fuel, lubricants, and other related products and services under the Farstad Oil, Rhinehart Oil, Tropic Oil, Superpumper, and Harts brands. The Supply segment manufactures transportation fuels; procures feedstocks and fuels from third parties; transports, stores, and markets fuels, crude oil, and liquid petroleum gases; and manufactures and sells aviation fuel to airlines. The International segment operates retail service stations under the Esso, Shell, and Sol brands; and delivers and supplies gasoline, diesel, fuel oil, propane, and lubricants to customers in various sectors, including power, oil and gas, and mining. This segment also engages in the wholesale, supply, and distribution business. The company was formerly known as Parkland Fuel Corporation and changed its name to Parkland Corporation in May 2020. The company was founded in 1977 and is headquartered in Calgary, Canada.   Parkland Corporation operates as a marketer, distributor, and refiner of fuel and petroleum products in Canada, the United States, and internationally. The company operates in five segments: Canada Retail, Canada Commercial, USA, Supply, and International.",
  "Parkland Corporation operates as a marketer, distributor, and refiner of fuel and petroleum products in Canada, the United States, and internationally. The company operates in five segments: Canada Retail, Canada Commercial, USA, Supply, and International. The Canada Retail segment supplies and supports a coast-to-coast network of 1,863 retail gas stations under the Ultramar, Esso, Fas Gas Plus, Chevron, and Pioneer, as well as operates convenience stores under the On the Run/Marche Express brand. The Canada Commercial segment offers bulk fuel, bulk and cylinder exchange propane, heating oil, lubricants, and other related products and services to commercial, industrial, and residential customers in various industries, such as oil and gas, construction, mining, forestry, fishing, and transportation under the Ultramar, Bluewave Energy, Pipeline Commercial, Chevron, Columbia Fuels, and Sparlings Propane brands. The USA segment operates a network of gas stations; and delivers bulk fuel, lubricants, and other related products and services under the Farstad Oil, Rhinehart Oil, Tropic Oil, Superpumper, and Harts brands. The Supply segment manufactures transportation fuels; procures feedstocks and fuels from third parties; transports, stores, and markets fuels, crude oil, and liquid petroleum gases; and manufactures and sells aviation fuel to airlines. The International segment operates retail service stations under the Esso, Shell, and Sol brands; and delivers and supplies gasoline, diesel, fuel oil, propane, and lubricants to customers in various sectors, including power, oil and gas, and mining. This segment also engages in the wholesale, supply, and distribution business. The company was formerly known as Parkland Fuel Corporation and changed its name to Parkland Corporation in May 2020. The company was founded in 1977 and is headquartered in Calgary, Canada.",
  "PBF Energy Inc., together with its subsidiaries, engages in refining and supplying petroleum products. The company operates in two segments, Refining and Logistics. It produces gasoline, ultra-low-sulfur diesel, heating oil, diesel fuel, jet fuel, lubricants, petrochemicals, and asphalt, as well as unbranded transportation fuels, petrochemical feedstocks, blending components, and other petroleum products. The company sells its products in Northeast, Midwest, Gulf Coast, and West Coast of the United States, as well as in other regions of the United States, Canada, and Mexico. It also offers various rail, truck, and marine terminaling services, as well as pipeline transportation and storage services. The company owns and operates five oil refineries and related assets. PBF Energy Inc. was founded in 2008 and is based in Parsippany, New Jersey.   PBF Energy Inc., together with its subsidiaries, engages in refining and supplying petroleum products. The company operates in two segments, Refining and Logistics.",
  "PBF Energy Inc., together with its subsidiaries, engages in refining and supplying petroleum products. The company operates in two segments, Refining and Logistics. It produces gasoline, ultra-low-sulfur diesel, heating oil, diesel fuel, jet fuel, lubricants, petrochemicals, and asphalt, as well as unbranded transportation fuels, petrochemical feedstocks, blending components, and other petroleum products. The company sells its products in Northeast, Midwest, Gulf Coast, and West Coast of the United States, as well as in other regions of the United States, Canada, and Mexico. It also offers various rail, truck, and marine terminaling services, as well as pipeline transportation and storage services. The company owns and operates five oil refineries and related assets. PBF Energy Inc. was founded in 2008 and is based in Parsippany, New Jersey.",
  "Phillips 66 operates as an energy manufacturing and logistics company. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S). The Midstream segment transports crude oil and other feedstocks; delivers refined products to market; provides terminaling and storage services for crude oil and petroleum products; transports, stores, fractionates, exports, and markets natural gas liquids; provides other fee-based processing services; and gathers, processes, transports, and markets natural gas. The Chemicals segment manufactures and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products comprising gasolines, distillates, and aviation fuels at 13 refineries in the United States and Europe. The M&S segment purchases for resale and markets refined petroleum products consisting of gasolines, distillates, and aviation fuels primarily in the United States and Europe. It also manufactures and markets specialty products, such as petroleum coke products, waxes, solvents, and polypropylene. Phillips 66 was founded in 1875 and is headquartered in Houston, Texas.   Phillips 66 operates as an energy manufacturing and logistics company. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S).",
  "Phillips 66 operates as an energy manufacturing and logistics company. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S). The Midstream segment transports crude oil and other feedstocks; delivers refined products to market; provides terminaling and storage services for crude oil and petroleum products; transports, stores, fractionates, exports, and markets natural gas liquids; provides other fee-based processing services; and gathers, processes, transports, and markets natural gas. The Chemicals segment manufactures and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products comprising gasolines, distillates, and aviation fuels at 13 refineries in the United States and Europe. The M&S segment purchases for resale and markets refined petroleum products consisting of gasolines, distillates, and aviation fuels primarily in the United States and Europe. It also manufactures and markets specialty products, such as petroleum coke products, waxes, solvents, and polypropylene. Phillips 66 was founded in 1875 and is headquartered in Houston, Texas.",
  "Plains All American Pipeline, L.P., through its subsidiaries, engages in the transportation, storage, terminalling, and marketing of crude oil, natural gas liquids (NGL), and natural gas in the United States and Canada. The company operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment transports crude oil and NGL through pipelines, gathering systems, trucks, and barges. As of December 31, 2019, this segment owned and leased 18,535 miles of active crude oil and NGL pipelines and gathering systems; 35 million barrels of active and above-ground tank capacity; 825 trailers; 50 transport and storage barges; and 20 transport tugs. The Facilities segment provides storage, terminalling, and throughput services for crude oil, NGL, and natural gas; and NGL fractionation and isomerization, and natural gas and condensate processing services. As of December 31, 2019, this segment owned and operated approximately 79 million barrels of crude oil storage capacity; 34 million barrels of NGL storage capacity; 63 billion cubic feet of natural gas storage working capacity; 25 billion cubic feet of base gas; seven natural gas processing plants; a condensate processing facility; eight fractionation plants; 30 crude oil and NGL rail terminals; six marine facilities; and approximately 430 miles of active pipelines. The Supply and Logistics segment purchases crude oil at the wellhead, pipeline, terminal, and rail facilities; stores inventory and NGL; purchases NGL from producers, refiners, processors, and other marketers; extracts NGL; resells or exchanges crude oil and NGL; and transports crude oil and NGL on trucks, barges, railcars, pipelines, and vessels. This segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill; 760 trucks and 900 trailers; and 8,000 crude oil and NGL railcars. The company was founded in 1998 and is headquartered in Houston, Texas.   Plains All American Pipeline, L.P., through its subsidiaries, engages in the transportation, storage, terminalling, and marketing of crude oil, natural gas liquids (NGL), and natural gas in the United States and Canada.",
  "Plains All American Pipeline, L.P., through its subsidiaries, engages in the transportation, storage, terminalling, and marketing of crude oil, natural gas liquids (NGL), and natural gas in the United States and Canada. The company operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment transports crude oil and NGL through pipelines, gathering systems, trucks, and barges. As of December 31, 2019, this segment owned and leased 18,535 miles of active crude oil and NGL pipelines and gathering systems; 35 million barrels of active and above-ground tank capacity; 825 trailers; 50 transport and storage barges; and 20 transport tugs. The Facilities segment provides storage, terminalling, and throughput services for crude oil, NGL, and natural gas; and NGL fractionation and isomerization, and natural gas and condensate processing services. As of December 31, 2019, this segment owned and operated approximately 79 million barrels of crude oil storage capacity; 34 million barrels of NGL storage capacity; 63 billion cubic feet of natural gas storage working capacity; 25 billion cubic feet of base gas; seven natural gas processing plants; a condensate processing facility; eight fractionation plants; 30 crude oil and NGL rail terminals; six marine facilities; and approximately 430 miles of active pipelines. The Supply and Logistics segment purchases crude oil at the wellhead, pipeline, terminal, and rail facilities; stores inventory and NGL; purchases NGL from producers, refiners, processors, and other marketers; extracts NGL; resells or exchanges crude oil and NGL; and transports crude oil and NGL on trucks, barges, railcars, pipelines, and vessels. This segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill; 760 trucks and 900 trailers; and 8,000 crude oil and NGL railcars. The company was founded in 1998 and is headquartered in Houston, Texas.",
  "Plains GP Holdings, L.P. owns and operates midstream energy infrastructure in the United States and Canada. It operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment engages in the transportation of crude oil and natural gas liquids (NGLs) on pipelines, gathering systems, trucks, and barges. As of December 31, 2019, it owned and leased assets comprising 18,535 miles of crude oil and NGL pipelines and gathering systems; 35 million barrels of above-ground tank capacity; 825 trailers; 50 transport and storage barges; and 20 transport tugs. The Facilities segment engages in the provision of storage, terminalling, and throughput services primarily for crude oil, NGLs, and natural gas; NGL fractionation and isomerization services; and natural gas and condensate processing services. This segment owned and operated approximately 79 million barrels of crude oil storage capacity; 34 million barrels of NGL storage capacity; 63 billion cubic feet of natural gas storage capacity; 25 billion cubic feet of base gas; seven natural gas processing plants; a condensate processing facility; eight fractionation plants; 30 crude oil and NGL rail terminals; six marine facilities; and 430 miles of pipelines. The Supply and Logistics segment engages in merchant-related activities, including purchase of crude oil, as well as NGL from producers, refiners, processors, and other marketers; storage of NGL and natural gas; and resale and transport of crude oil and NGL. This segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill in pipelines owned by third parties and other inventory; 760 trucks and 900 trailers; and 8,000 crude oil and NGL railcars. The company offers logistics services, primarily for crude oil, NGLs, and natural gas. PAA GP Holdings LLC operates as a general partner of the company. Plains GP Holdings, L.P. was founded in 2013 and is headquartered in Houston, Texas.",
  "PQ Group Holdings Inc. provides specialty catalysts, materials, chemicals, and services in the United States, the Netherlands, the United Kingdom, and internationally. The company operates through four segments: Refining Services, Catalysts, Performance Materials, and Performance Chemicals. The Refining Services segment offers sulfuric acid recycling and end-to-end logistics services to produce alkylate; and virgin sulfuric acid for water treatment, mining, and industrial applications. The Catalysts segment provides silica catalysts and zeolite catalysts for producers and licensors of polyethylene and methyl methacrylate. The Performance Materials segment offers transportation safety microspheres for various binders, such as paint and epoxy coatings; and engineered glass materials, including solid and hollow microspheres and particles for uses, such as strengthening and light-weighting in plastics and polymer additives, cleaning and peening of metal surfaces, and conductivity or shielding in electronic applications. The Performance Chemicals segment offers sodium silicates for construction, cleaning, water treatment, pulp and paper, foundry and refractory, green tires, electronics, and refining catalysts; and specialty silicas for use as ingredients in personal care products, foods, edible oils, and beers, as well as industrial uses consisting of gloss control in coil, wood, general industrial leather, and other surface coating applications. This segment also provides other silicate derivatives, including metasilicates, spray dried silicates, and magnesium and potassium silicates for use in cleaning, specialty fertilizer, oil and gas, mining, paint, food, and cosmetic applications, as well as zeolites for use as builders for detergents and other applications, such as stabilizers for the production of polyvinylchloride applications. PQ Group Holdings Inc. was founded in 1831 and is headquartered in Malvern, Pennsylvania.",
  "Quaker Chemical Corporation develops, produces, and markets various formulated chemical specialty products for a range of heavy industrial and manufacturing applications. It operates through four segments: Americas; Europe, Middle East, and Africa; Asia/Pacific; and Global Specialty Businesses. The company offers metal removal fluids, cleaning fluids, corrosion inhibitors, metal drawing and forming fluids, die cast mold releases, heat treatment and quenchants, metal forging fluids, hydraulic fluids, specialty greases, offshore sub-sea energy control fluids, rolling lubricants, rod and wire drawing fluids, and surface treatment chemicals. It also provides chemical management services. The company serves steel, aluminum, automotive, aerospace, offshore, can, mining, and metalworking companies. The company was formerly known as Quaker Chemical Products Corporation and changed its name to Quaker Chemical Corporation in August 1962. Quaker Chemical Corporation was founded in 1918 and is headquartered in Conshohocken, Pennsylvania.",
  "Renewable Energy Group, Inc. provides lower carbon transportation fuels in the United States and internationally. The company utilizes an integrated production, distribution, and logistics system to convert natural fats, oils, and greases into advanced biofuels. It operates through Biomass-Based Diesel, Services, and Corporate and Other segments. The company produces biomass-based diesel from various carbon feedstocks, including distillers corn and used cooking oils, and inedible animal fats, as well as from soybean or canola oils. It is also involved in the purchase and resale of biomass-based diesel, petroleum-based diesel, renewable identification numbers, California Low Carbon Fuel Standard credits, and raw material feedstocks acquired from third parties; and sale of biomass-based diesel produced under toll manufacturing arrangements with third party facilities using its feedstocks. In addition, the company provides day-to-day management and operational services to biomass-based diesel production facilities; and construction management and general contracting services for the construction or upgrade of biomass-based diesel production facilities. Further, it sells petroleum-based heating oils and diesel fuels, as well as operates fermentation facilities. The company owns and operates a network of 13 biorefineries, including eleven biorefineries located in the United States and two biorefineries located in Germany. Renewable Energy Group, Inc. was founded in 1996 and is headquartered in Ames, Iowa.   Renewable Energy Group, Inc. provides lower carbon transportation fuels in the United States and internationally. The company utilizes an integrated production, distribution, and logistics system to convert natural fats, oils, and greases into advanced bio fuels.",
  "Renewable Energy Group, Inc. provides lower carbon transportation fuels in the United States and internationally. The company utilizes an integrated production, distribution, and logistics system to convert natural fats, oils, and greases into advanced biofuels. It operates through Biomass-Based Diesel, Services, and Corporate and Other segments. The company produces biomass-based diesel from various carbon feedstocks, including distillers corn and used cooking oils, and inedible animal fats, as well as from soybean or canola oils. It is also involved in the purchase and resale of biomass-based diesel, petroleum-based diesel, renewable identification numbers, California Low Carbon Fuel Standard credits, and raw material feedstocks acquired from third parties; and sale of biomass-based diesel produced under toll manufacturing arrangements with third party facilities using its feedstocks. In addition, the company provides day-to-day management and operational services to biomass-based diesel production facilities; and construction management and general contracting services for the construction or upgrade of biomass-based diesel production facilities. Further, it sells petroleum-based heating oils and diesel fuels, as well as operates fermentation facilities. The company owns and operates a network of 13 biorefineries, including eleven biorefineries located in the United States and two biorefineries located in Germany. Renewable Energy Group, Inc. was founded in 1996 and is headquartered in Ames, Iowa.",
  "REX American Resources Corporation, together with its subsidiaries, produces and sells ethanol. It operates in two segments, Ethanol and By-Products, and Refined Coal. The company also offers distillers grains and non-food grade corn oil; and dry distillers grains with solubles, which is used as a protein in animal feed. In addition, it produces, processes, and sells refined coal. The company was formerly known as REX Stores Corporation and changed its name to REX American Resources Corporation in June 2010. REX American Resources Corporation was founded in 1980 and is headquartered in Dayton, Ohio.",
  "RPM International Inc. manufactures and sells specialty chemicals for the industrial, specialty, and consumer markets worldwide. It offers waterproofing, coatings, and institutional roofing systems; sealants, air barriers, tapes, and foams; residential home weatherization systems; roofing and building maintenance and related services; sealing and bonding, and flooring and in-plant glazing solutions; solutions for fire stopping and intumescent steel coating, and the manufacturing industry; rolled asphalt roofing materials and chemical admixtures; concrete and masonry admixtures, concrete fibers, curing and sealing compounds, structural grouts and mortars, epoxy adhesives, injection resins, polyurethane foams, floor hardeners and toppings, joint fillers and sealants, industrial and architectural coatings, decorative color/stains/stamps, and restoration materials; and insulated building cladding materials and concrete form wall systems. It also provides polymer flooring systems; fiberglass reinforced plastic gratings and shapes; corrosion-control coating, containment lining, fire and sound proofing, and insulation products; and specialty construction products; and amine curing agents, reactive diluents, specialty epoxy resins and other intermediates. In addition, it offers fluorescent colorants and pigments; shellac-based-specialty and marine coatings; fire and water damage restoration, and carpet cleaning and disinfecting products; fuel additives; wood treatments, furniture finishes, and touch-up products; and nail enamels, polishes, and coating components. Further, it offers specialty products for paint contractors and the DIYers, deck and fence restoration products, metallic and faux finish coatings, exterior wood deck and concrete restoration systems, flooring finishes, and hobby paints and cements; and caulk, sealant, adhesive, insulating foam, spackling, glazing, and patch and repair products. The company was founded in 1947 and is headquartered in Medina, Ohio.",
  "Sensient Technologies Corporation, together with its subsidiaries, develops, manufactures, and markets colors, flavors, and fragrances in North America, Europe, the Asia Pacific, and internationally. It operates through three segments: Flavors & Fragrances Group, Color Group, and Asia Pacific Group. The company offers flavor-delivery systems, and compounded and blended products; ingredient products, such as essential oils, natural and synthetic flavors, and natural extracts; fragrance products; and chili powder, paprika, and chili pepper, as well as dehydrated vegetables comprising parsley, celery, and spinach to the food, beverage, personal care, and household-products industries. It also provides natural and synthetic color systems for use in foods, beverages, pharmaceuticals, and nutraceuticals; colors and other ingredients for cosmetics, such as active ingredients, solubilizers, and surface treated pigments; pharmaceutical and nutraceutical excipients, including colors, flavors, coatings, and nutraceutical ingredients; specialty inks; and technical colors for industrial applications under the Sensient Food Colors, Sensient Pharmaceutical Coating Systems, Sensient Cosmetic Technologies, Sensient Imaging Technologies/Sensient Inks, and Sensient Industrial Colors trade names. The company was founded in 1882 and is headquartered in Milwaukee, Wisconsin.",
  "Sprague Resources LP engages in the purchase, storage, distribution, and sale of refined petroleum products and natural gas in the United States and Canada. The company operates through four segments: Refined Products, Natural Gas, Materials Handling, and Other Operations. The Refined Products segment purchases and sells various refined products, such as heating oil, diesel fuel, residual fuel oil, kerosene, jet fuel, gasoline, and asphalt to wholesale, retail, and commercial customers. This segment's wholesale customers consist of approximately 1,100 home heating oil retailers, and diesel fuel and gasoline resellers; and commercial customers include federal and state agencies, municipalities, regional transit authorities, drill sites, large industrial companies, real estate management companies, hospitals, educational institutions, and asphalt paving companies. The natural gas segment purchases natural gas from natural gas producers and trading companies and sells and distributes natural gas to approximately 14,000 commercial and industrial customer locations across 13 states in the Northeast and Mid-Atlantic United States. The Materials Handling segment offloads, stores, and prepares for the delivery of various customer-owned products, including asphalt, crude oil, clay slurry, salt, gypsum, residual fuel oil, coal, petroleum coke, caustic soda, tallow, pulp, and heavy equipment. The Other Operations segment engages in coal marketing and distribution; and commercial trucking activities. As of December 31, 2019, the company had combined storage capacity of 14.3 million barrels for refined products and other liquid materials, as well as 2.0 million square feet of materials handling capacity. Sprague Resources LP was founded in 1870 and is headquartered in Portsmouth, New Hampshire.   Sprague Resources LP engages in the purchase, storage, distribution, and sale of refined petroleum products and natural gas in the United States and Canada. The company operates through four segments: Refined Products, Natural Gas, Materials Handling, and Other Operations.",
  "Sprague Resources LP engages in the purchase, storage, distribution, and sale of refined petroleum products and natural gas in the United States and Canada. The company operates through four segments: Refined Products, Natural Gas, Materials Handling, and Other Operations. The Refined Products segment purchases and sells various refined products, such as heating oil, diesel fuel, residual fuel oil, kerosene, jet fuel, gasoline, and asphalt to wholesale, retail, and commercial customers. This segment's wholesale customers consist of approximately 1,100 home heating oil retailers, and diesel fuel and gasoline resellers; and commercial customers include federal and state agencies, municipalities, regional transit authorities, drill sites, large industrial companies, real estate management companies, hospitals, educational institutions, and asphalt paving companies. The natural gas segment purchases natural gas from natural gas producers and trading companies and sells and distributes natural gas to approximately 14,000 commercial and industrial customer locations across 13 states in the Northeast and Mid-Atlantic United States. The Materials Handling segment offloads, stores, and prepares for the delivery of various customer-owned products, including asphalt, crude oil, clay slurry, salt, gypsum, residual fuel oil, coal, petroleum coke, caustic soda, tallow, pulp, and heavy equipment. The Other Operations segment engages in coal marketing and distribution; and commercial trucking activities. As of December 31, 2019, the company had combined storage capacity of 14.3 million barrels for refined products and other liquid materials, as well as 2.0 million square feet of materials handling capacity. Sprague Resources LP was founded in 1870 and is headquartered in Portsmouth, New Hampshire.",
  "Suncor Energy Inc. operates as an integrated energy company. The company primarily focuses on developing petroleum resource basins in Canada's Athabasca oil sands; explores, acquires, develops, produces, and markets crude oil in Canada and internationally; markets petroleum and petrochemical products under the Petro-Canada name primarily in Canada. It operates in Oil Sands; Exploration and Production; Refining and Marketing; and Corporate and Eliminations segments. The Oil Sands segment recovers bitumen from mining and in situ operations, and upgrades it into refinery feedstock and diesel fuel, or blends the bitumen with diluent for direct sale to market. The Exploration and Production segment is involved in offshore operations off the east coast of Canada and in the North Sea; and operating onshore assets in Libya and Syria. The Refining and Marketing segment refines crude oil and intermediate feedstock into various petroleum and petrochemical products; and markets refined petroleum products to retail, commercial, and industrial customers through its dealers, sales channel, other retail stations, and wholesale customers. The Corporate and Eliminations segment operates four wind farm operations in Ontario and Western Canada. The company also markets and trades in crude oil, natural gas, byproducts, refined products, and power. The company was formerly known as Suncor Inc. and changed its name to Suncor Energy Inc. in April 1997. Suncor Energy Inc. was founded in 1917 and is headquartered in Calgary, Canada.",
  "Sunoco LP, together with its subsidiaries, engages in the distribution and retailing of motor fuels in the United States. It operates through two segments, Fuel Distribution and Marketing, and All Other. The Fuel Distribution and Marketing segment purchases motor fuel from independent refiners and major oil companies and supplies it to independently operated dealer stations, distributors and other consumer of motor fuel, and partnership operated stations, as well as to commission agent locations. The All Other segment operates retail stores that offer motor fuel, merchandise, foodservice, and other services that include car washes, lottery, automated teller machines, money orders, prepaid phone cards, and wireless services. It also leases and rents real estate properties. Sunoco GP LLC serves as the general partner of the company. The company was formerly known as Susser Petroleum Partners LP and changed its name to Sunoco LP in October 2014. Sunoco LP was incorporated in 2012 and is headquartered in Dallas, Texas.",
  "Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of midstream energy assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company engages in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; gathering, storing, terminaling, and selling crude oil; and storing, terminaling, and selling refined petroleum products. It is also involved in the purchase and resale of NGL products; and wholesale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. It operates approximately 28,900 miles of natural gas pipelines, including 46 owned and operated processing plants; and owns or operates a total of 34 storage wells with a gross storage capacity of approximately 72 million barrels. As of December 31, 2019, the company leased and managed approximately 698 railcars; 138 transport tractors; and 2 company-owned pressurized NGL barges. Targa Resources Corp. was founded in 2005 and is headquartered in Houston, Texas.   Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of midstream energy assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Trans portation.",
  "Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of midstream energy assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company engages in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; gathering, storing, terminaling, and selling crude oil; and storing, terminaling, and selling refined petroleum products. It is also involved in the purchase and resale of NGL products; and wholesale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. It operates approximately 28,900 miles of natural gas pipelines, including 46 owned and operated processing plants; and owns or operates a total of 34 storage wells with a gross storage capacity of approximately 72 million barrels. As of December 31, 2019, the company leased and managed approximately 698 railcars; 138 transport tractors; and 2 company-owned pressurized NGL barges. Targa Resources Corp. was founded in 2005 and is headquartered in Houston, Texas.",
  "Trecora Resources manufactures and sells various specialty petrochemical products and specialty waxes in the United States. The company operates in two segments, Specialty Petrochemical and Specialty Waxes. The Specialty Petrochemical segment offers hydrocarbons and other petroleum based products, including isopentane, normal pentane, isohexane, and hexane for use in the production of polyethylene, packaging, polypropylene, expandable polystyrene, poly-iso/urethane foams, and crude oil from the Canadian tar sands, as well as in the catalyst support industry. It also owns and operates pipelines. The Specialty Waxes segment provides specialty polyethylene for use in the paints and inks, adhesives, coatings, and PVC lubricants markets; and specialized synthetic poly alpha olefin waxes for use as toner in printers, as well as additives for candles. This segment also provides custom processing services. In addition, the company produces copper and zinc concentrates, and silver and gold dore. Trecora Resources was formerly known as Arabian American Development Company and changed its name to Trecora Resources in June 2014. Trecora Resources was founded in 1967 and is based in Sugar Land, Texas.",
  "Union Carbide Corporation operates as a chemical and polymer company in the United States, the Asia Pacific, and internationally. It offers ethylene oxide/ethylene glycol to manufacture monoethylene glycol, polyethylene glycol, glycol ethers, ethanolamines, surfactants, and other chemicals and polymers; di-and triethylene glycol for use in boat construction, shoe manufacturing, natural gas-drying, and moisture-removing applications; plasticizers for safety glasses; tetraethylene glycol to produce plasticizers for automotive windows; hydrocarbons, including ethylene and propylene, and internal feedstocks; and licenses and supplies catalysts. The company also provides industrial chemicals and polymers, such as acrolein and derivatives, glutaraldehydes, polyethylene and methoxypolyethylene glycols, surfactants, deicing fluids, and heat transfer fluids for pharmaceutical, animal food supplement, personal care, industrial and household cleaning, coatings for beverage and food cans, industrial coatings, and other industrial uses; and low density polyethylene resins to produce hose and tubing, frozen-food bags, and stretch wraps, as well as linear low density and high density polyethylene resins used in housewares, grocery sacks, trash bags, packaging, and water and gas pipes, as well as milk, water, bleach, and detergent bottles. In addition, it offers solvents and intermediates, such as oxo aldehydes, acids, alcohols, and esters; vinyl acetate monomer, a building block to manufacture polymers used in water-based emulsion paints, adhesives, paper coatings, textiles, safety glass, and acrylic fibers; water soluble polymers, such as water-soluble resins and products for hair and skin; and polyolefin-based compounds, which include polyethylene-based wire and cable, polyethylene-based low voltage insulation, flame-retardant, reduced emissions flame-retardant, and purging compounds. The company was founded in 1917 and is headquartered in Seadrift, Texas.",
  "Univar Solutions Inc. distributes commodity and specialty chemical products, and related services worldwide. It also provides epoxy resins, polyurethanes, titanium dioxide, fumed silica, esters, plasticizers, silicones, and specialty amines; chemicals and service to midstream pipeline and downstream refinery operators; and commodity and specialty products for meat processing, baked goods, dairy, grain mill products, processed foods, carbonated soft drinks, fruit drinks, and alcoholic beverage markets. In addition, the company offers chemical products for use at various stages of production, from sap stain prevention to pulp and paper manufacturing; ingredients for cleaners, detergents, and disinfectant products; base stocks and performance-enhancing additives for lubricants and metalworking fluids; excipients, solvents, reactants, active pharmaceutical ingredients, and intermediates to pharmaceutical ingredient producers; and products for water treatment that includes pH adjusters, flocculants, coagulants, dechlorinators, and disinfectants. Further, it provides transportation and warehousing infrastructure, chemicals and hazardous materials handling, waste management services, inventory management, and blending and repackaging services, as well as industrial cleaning, site remediation, and emergency environmental response services. Univar Solutions Inc. distributes its products through warehouse and direct-to-consumer delivery channels. The company was formerly known as Univar Inc. and changed its name to Univar Solutions Inc. in September 2019. The company was founded in 1924 and is headquartered in Downers Grove, Illinois.",
  "Valero Energy Corporation manufactures and sells transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, and internationally. It operates through three segments: Refining, Ethanol, and Renewable Diesel. The company is involved in oil and gas refining, marketing, and bulk selling activities. It produces conventional and premium gasolines, gasoline meeting the specifications of the California Air Resources Board (CARB), diesel fuels, low-sulfur and ultra-low-sulfur diesel fuels, CARB diesel, other distillates, jet fuels, asphalts, petrochemicals, lubricants, and other refined petroleum products. As of December 31, 2019, the company owned 15 petroleum refineries with a combined throughput capacity of approximately 3.15 million barrels per day. It markets its refined products through wholesale rack and bulk markets; and through approximately 7,000 outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brand names. The company also produces and sells ethanol, distiller grains, and corn oil primarily to refiners and gasoline blenders, as well as to animal feed customers. It owns and operates 14 ethanol plants with a combined ethanol production capacity of approximately 1.73 billion gallons per year. In addition, the company owns, operates, develops, and acquires crude oil and refined petroleum products pipelines, terminals, and other transportation and logistics assets. Further, it owns and operates a plant that processes animal fats, used cooking oils, and other vegetable oils into renewable diesel. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.",
  "Valhi, Inc. engages in the chemicals, component products, and real estate management and development businesses in the Asia Pacific, Europe, North America, and internationally. The company's Chemicals segment produces and markets titanium dioxide pigments (TiO2), which are white inorganic pigments used in various applications by paint, plastics, decorative laminate, and paper manufacturers. It offers TiO2 under the KRONOS name through agents and distributors. This segment also offers ilmenite, a raw material used directly as a feedstock by sulfate-process TiO2 plants; iron-based chemicals; and titanium oxychloride and titanyl sulfate. The company's Component Products segment manufactures mechanical and electrical cabinet locks, and other locking mechanisms for use in ignition systems, mailboxes, file cabinets, desk drawers, tool storage cabinets, vending and gaming machines, medical cabinetry security, electronic circuit panels, storage compartments, and gas station security applications. It also provides stainless steel exhaust components, gauges, throttle controls, wake enhancement systems, trim tabs, and related hardware and accessories primarily for performance and ski/wakeboard boats. The company's Real Estate Management and Development segment offers utility services to industrial and municipal customers; owns real properties; and develops land holdings for commercial, industrial, and residential purposes. It also provides insurance brokerage and risk management services; and holds marketable securities and other investments. The company is based in Dallas, Texas. Valhi, Inc. is a subsidiary of Contran Corporation.",
  "Valvoline Inc. manufactures and markets engine and automotive maintenance products and services. It operates through three segments: Quick Lubes, Core North America, and International. The company offers lubricants for passenger car, light duty, and heavy duty; antifreeze/coolants for original equipment manufacturers; functional and maintenance chemicals, such as brake fluids and power steering fluids, as well as specialty coatings for automotive and industrial applications comprising rust prevention and sound absorption; and oil and air filters for light-duty vehicles. It also provides windshield wiper blades, light bulbs, serpentine belts, and drain plugs. In addition, the company operates Valvoline instant oil change service centers. As of January 2, 2020, it operated and franchised approximately 1,400 quick-lube locations under the Valvoline Instant Oil Change brand in the United States and the Great Canadian Oil Change brand in Canada. The company also serves car dealers, general repair shops, and third-party quick lube locations, as well as through distributors. It has operations in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. Valvoline Inc. was founded in 1866 and is headquartered in Lexington, Kentucky.",
  "WD-40 Company develops and sells maintenance products, and homecare and cleaning products in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers multi-purpose maintenance products, including aerosol sprays, non-aerosol trigger sprays, and in liquid-bulk form products under the WD-40 Multi-Use brand name for various consumer uses and industrial applications; specialty maintenance products, such as penetrants, degreasers, corrosion inhibitors, greases, lubricants, and rust removers under the WD-40 Specialist brand; and bicycle maintenance products comprising wet and dry chain lubricants, chain cleaners and degreasers, and foaming wash products for avid and recreational cyclists, bike enthusiasts, and mechanics under the WD-40 Bike brand name. It also provides multi-purpose and specialty drip oils, and spray lubricant products, as well as other specialty maintenance products under the 3-IN-ONE brand name; and professional spray maintenance products and lubricants for the bike market under the GT85 brand name. In addition, the company offers automatic toilet bowl cleaners under the 2000 Flushes brand name; aerosol carpet stain removers, and a liquid trigger carpet stain and odor eliminators under the Spot Shot brand; room and rug deodorizers under the Carpet Fresh brand name; carpet and household cleaners, and rug and room deodorizers under the 1001 brand; heavy-duty hand cleaner products under the Lava brand name in the United States, as well as under the Solvol brand in Australia; and liquid mildew stain removers and automatic toilet bowl cleaners under the X-14 brand name. It sells its products primarily through mass retail and home center stores, warehouse club stores, grocery stores, hardware stores, automotive parts outlets, sport retailers, independent bike dealers, online retailers, and industrial distributors and suppliers. WD-40 Company was founded in 1953 and is headquartered in San Diego, California.",
  "Westlake Chemical Corporation, together with its subsidiaries, manufactures and markets basic chemicals, vinyls, polymers, and building products worldwide. It operates through two segments, Olefins and Vinyls. The Olefins segment offers polyethylene, styrene monomers, and various ethylene co-products, as well as sells propylene, crude butadiene, pyrolysis gasoline, and hydrogen products. The Vinyls segment provides specialty and commodity polyvinyl chloride (PVC), vinyl chloride monomers, ethylene dichloride, chlorine, caustic soda, chlorinated derivative, and ethylene products. This segment also manufactures and sells PVC compounds and building products fabricated from PVC, including residential siding, trim and moulding, pipe and fittings for various water, sewer and industrial applications, profiles for windows and doors, decking products, film for various inflatables, wall covering tapes, roofing applications, and composite roof tiles. Westlake Chemical Corporation offers its products to a range of customers, including chemical processors, plastics fabricators, small construction contractors, municipalities, and supply warehouses in various consumer and industrial markets, such as flexible and rigid packaging, automotive products, coatings, water treatment, refrigerants, and residential and commercial construction, as well as other durable and non-durable goods. The company was founded in 1986 and is headquartered in Houston, Texas. Westlake Chemical Corporation is a subsidiary of TTWF LP.   Westlake Chemical Corporation, together with its subsidiaries, manufactures and markets basic chemicals, vinyls, polymers, and building products worldwide. It operates through two segments, Olefins and Vinyls.",
  "Westlake Chemical Corporation, together with its subsidiaries, manufactures and markets basic chemicals, vinyls, polymers, and building products worldwide. It operates through two segments, Olefins and Vinyls. The Olefins segment offers polyethylene, styrene monomers, and various ethylene co-products, as well as sells propylene, crude butadiene, pyrolysis gasoline, and hydrogen products. The Vinyls segment provides specialty and commodity polyvinyl chloride (PVC), vinyl chloride monomers, ethylene dichloride, chlorine, caustic soda, chlorinated derivative, and ethylene products. This segment also manufactures and sells PVC compounds and building products fabricated from PVC, including residential siding, trim and moulding, pipe and fittings for various water, sewer and industrial applications, profiles for windows and doors, decking products, film for various inflatables, wall covering tapes, roofing applications, and composite roof tiles. Westlake Chemical Corporation offers its products to a range of customers, including chemical processors, plastics fabricators, small construction contractors, municipalities, and supply warehouses in various consumer and industrial markets, such as flexible and rigid packaging, automotive products, coatings, water treatment, refrigerants, and residential and commercial construction, as well as other durable and non-durable goods. The company was founded in 1986 and is headquartered in Houston, Texas. Westlake Chemical Corporation is a subsidiary of TTWF LP.",
  "Westlake Chemical Partners LP acquires, develops, and operates ethylene production facilities and related assets in the United States. The company's ethylene production facilities primarily convert ethane into ethylene. It also sells ethylene co-products, including propylene, crude butadiene, pyrolysis gasoline, and hydrogen directly to third parties on a spot or contract basis. Westlake Chemical Partners GP LLC serves as the general partner of the company. The company was founded in 2014 and is headquartered in Houston, Texas.",
  "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Atlantic-Gulf, Northeast G&P, and West segments. The Atlantic-Gulf segment comprises Transco, an interstate natural gas pipeline; and natural gas gathering and processing, and crude oil production handling and transportation assets. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities. The West segment comprises Northwest Pipeline, an interstate natural gas pipeline; and gas gathering, processing, and treating operations. The company owns and operates 30,000 miles of pipelines, 28 processing facilities, 7 fractionation facilities, and approximately 23 million barrels of NGL storage capacity. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
  "World Fuel Services Corporation engages in the distribution of fuel, and related products and services in the aviation, marine, and land transportation industries worldwide. Its Aviation segment supplies fuel, and related products and services to commercial airlines, second and third tier airlines, cargo carriers, regional and low-cost carriers, airports, fixed based operators, corporate fleets, fractional operators, private aircraft, the U.S. and foreign governments, intergovernmental organizations, and military customers. This segment also offers fuel management, price risk management, ground handling, and dispatch services, as well as international trip planning services, such as flight plans, weather reports, and overflight permits. The company's Land segment offers fuel, heating oil, propane, natural gas, lubricants, and related products and services to petroleum distributors and retail petroleum operators, as well as industrial, commercial, residential, and government customers. This segment also offers management services for procuring fuel and price risk management; advisory and fulfillment solutions related to power, natural gas, and other energy products; and card payment solutions, government payment systems for fuel procurement, merchant processing services, toll payment solutions, and commercial payment programs. Its Marine segment markets fuel, lubricants, and related products and services to international container and tanker fleets, commercial cruise lines, yachts and time charter operators, offshore rig owners and operators, the U.S. and foreign governments, and other fuel suppliers. Its marine fuel-related services include management services to procure fuel, cost control, quality control, claims management, and card payment and related processing services. This segment also engages in the fueling of vessels, and transportation and delivery of fuel and fuel-related products. The company was founded in 1984 and is headquartered in Miami, Florida."
]
